lucas-traumen/Plant-Monitoring-CPS/esp32/esp32_v1/main/main.c
/**
 * @file main.c
 * @brief ESP32 Firmware v2.9.6 — Realtime Command Priority + Sensor Cache
 *
 * @details
 * - Sensors: DHT11, BH1750, ADS1115 4-point soil array, DS3231 RTC
 * - Actuator: Pump relay (active HIGH, GPIO 19), Light relay (GPIO 18)
 * - Protocol: MQTT → Raspberry Pi broker qua router/LAN (topic: cps/greenhouse/brassica_01/telemetry/sensors)
 * - Network: ESP32 kết nối WiFi router thường; Raspberry Pi dùng LAN IP 192.168.2.54 làm MQTT broker.
 * - Filtering: median samples -> EMA -> stuck/outlier check -> Schmid-Schossmaier FTI fusion.
 * - Planting sync: ESP32 NVS is local cache; Gateway/DB is the source of truth.
 * - Phase owner: ESP32 đọc DS3231 RTC, tự tính Phase 1/2 theo planting_start_time,
 *   tự điều khiển đèn theo phase và gửi phase lên Raspberry Pi Gateway.
 * - Time sync: WiFi có mạng -> NTP -> cập nhật DS3231 nếu lệch > 5 giây.
 * - Realtime control: MQTT callback chỉ enqueue, actuator_cmd_task ưu tiên cao xử lý Pump/Light.
 * - Sensor realtime mềm: publish 1s/gói; DHT11 đọc riêng 2s/lần và cache giá trị để tránh checksum block command.
 */

#include <stdio.h>
#include <string.h>
#include <strings.h>
#include <stdlib.h>
#include <time.h>
#include <sys/time.h>

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/event_groups.h"
#include "freertos/semphr.h"
#include "freertos/queue.h"

#include "esp_system.h"
#include "esp_wifi.h"
#include "esp_event.h"
#include "esp_netif.h"
#include "esp_sntp.h"
#include "esp_log.h"
#include "esp_timer.h"
#include "nvs_flash.h"
#include "nvs.h"
#include "driver/i2c_master.h"
#include "driver/gpio.h"
#include "mqtt_client.h"
#include "i2cdev.h"

#include <ads111x.h>
#include "bh1750.h"
#include "esp32-dht11.h"
#include "ds3231.h"

/* Compatibility: một số ESP-IDF dùng SNTP_OPMODE_POLL thay vì ESP_SNTP_OPMODE_POLL. */
#ifndef ESP_SNTP_OPMODE_POLL
#define ESP_SNTP_OPMODE_POLL SNTP_OPMODE_POLL
#endif

/* ================================================================
   CẤU HÌNH WIFI — ESP32 KẾT NỐI WIFI ROUTER THƯỜNG
   ================================================================ */

/**
 * @brief Cấu trúc lưu trữ thông tin mạng WiFi
 */
typedef struct {
    const char *ssid;
    const char *password;
} wifi_cred_t;

/**
 * @brief Danh sách WiFi cho ESP32.
 *
 * Bản v2.9.8.3 chuyển khỏi Raspberry Pi hotspot, bỏ sensors/latest không dùng và trả DHT11 về GPIO4.
 * ESP32 nên bắt WiFi router thường; Raspberry Pi cắm LAN vào router.
 *
 * QUAN TRỌNG: đổi ROUTER_WIFI_PASS thành mật khẩu WiFi thật trước khi flash.
 */
#ifndef ROUTER_WIFI_SSID
#define ROUTER_WIFI_SSID "Phòng toàn trai đẹp"
#endif
#ifndef ROUTER_WIFI_PASS
#define ROUTER_WIFI_PASS "aicungdeptrai<3"
#endif

static const wifi_cred_t WIFI_NETWORKS[] = {
    /* Router WiFi thường; Pi broker qua LAN: 192.168.2.54:1883 */
    {ROUTER_WIFI_SSID, ROUTER_WIFI_PASS}
};
#define WIFI_NETWORK_COUNT (sizeof(WIFI_NETWORKS) / sizeof(wifi_cred_t))
#define WIFI_MAX_RETRY       3      /**< Số lần thử tối đa cho mỗi mạng trước khi đổi mạng khác */
#define WIFI_SCAN_MAX_AP     50     /**< Số AP tối đa lưu khi scan; tăng để tránh “quét thiếu mạng” */
#define WIFI_BOOT_WAIT_MS    30000  /**< Thời gian chờ WiFi lúc boot; không quá ngắn để tránh offline giả */
#define WIFI_SCAN_MIN_MS     250    /**< Active scan min time per channel */
#define WIFI_SCAN_MAX_MS     900    /**< Active scan max time per channel */

/* ================================================================
   CẤU HÌNH HỆ THỐNG KHÁC
   ================================================================ */

#define NODE_ID              "BRASSICA_JUNCEA_01"
#define PLANT_NAME           "Rau Cải Mầm (Brassica juncea)"
#define FW_VERSION           "2.9.8.3-router-lan-no-latest-dht-gpio4"

/* MQTT */
#define MQTT_BROKER_URI      "mqtt://192.168.2.54"  /* Raspberry Pi eth0 LAN broker, MQTT_PORT=1883 */
#define MQTT_PORT            1883
#define MQTT_KEEPALIVE_S     60
/* v2.9.7: tách QoS theo loại dữ liệu để tránh nghẽn socket MQTT.
 * - Command/ACK/Status vẫn QoS1 cho chắc.
 * - Telemetry realtime 1s dùng QoS0, không lưu offline/drain lại 64 gói cũ.
 */
#define MQTT_QOS             1   /* backward-compatible default */
#define MQTT_QOS_COMMAND     1
#define MQTT_QOS_STATUS      1
#define MQTT_QOS_TELEMETRY   0
#define MQTT_CLIENT_ID       "esp32_brassica_01"

/* MQTT topic tree v2: cps/greenhouse/<node>/... */
#define TOPIC_ROOT           "cps/greenhouse"
#define NODE_TOPIC_ID        "brassica_01"

/* ESP32 -> Broker */
#define TOPIC_SENSOR \
    TOPIC_ROOT "/" NODE_TOPIC_ID "/telemetry/sensors"


#define TOPIC_STATUS_ESP32 \
    TOPIC_ROOT "/" NODE_TOPIC_ID "/status/esp32"

#define TOPIC_ACTUATOR_STATE \
    TOPIC_ROOT "/" NODE_TOPIC_ID "/state/actuator"

/* Gateway -> Broker */
#define TOPIC_STATUS_GATEWAY \
    TOPIC_ROOT "/gateway/status"

/* Raspberry Pi Gateway AI AUTO -> ESP32 */
#define TOPIC_CMD_PUMP_AUTO \
    TOPIC_ROOT "/" NODE_TOPIC_ID "/cmd/auto/pump"

/* Unity/Web/Digital Twin DIRECT -> ESP32 */
#define TOPIC_CMD_PUMP_DIRECT \
    TOPIC_ROOT "/" NODE_TOPIC_ID "/cmd/direct/pump"

#define TOPIC_CMD_LIGHT_DIRECT \
    TOPIC_ROOT "/" NODE_TOPIC_ID "/cmd/direct/light"

/* Config command */
#define TOPIC_CMD_PLANTING_START \
    TOPIC_ROOT "/" NODE_TOPIC_ID "/cmd/config/planting_start"

/* GPIO & HW MUX */
#define I2C_MASTER_SDA       21
#define I2C_MASTER_SCL       22
#define I2C_MASTER_PORT      I2C_NUM_0

#define DHT11_GPIO           16
#define RELAY_PUMP_GPIO      19      /* Active HIGH */
#define RELAY_LIGHT_GPIO     18      /* Active HIGH */

/* ADS1115 Configuration */
#define ADS1115_I2C_ADDR     ADS111X_ADDR_GND   /* 0x48 */
#define SOIL_CH_COUNT        4
static const ads111x_mux_t SOIL_MUX[SOIL_CH_COUNT] = {
    ADS111X_MUX_0_GND,   /* AIN0 */
    ADS111X_MUX_1_GND,   /* AIN1 */
    ADS111X_MUX_2_GND,   /* AIN2 */
    ADS111X_MUX_3_GND,   /* AIN3 */
};

/* BH1750 */
#define BH1750_I2C_ADDR      BH1750_ADDR_LO     /* 0x23 */

/* Agronomic Parameters */
#define TEMP_IDEAL_MIN       18.0f
#define TEMP_IDEAL_MAX       24.0f
#define TEMP_GERM_IDEAL      22.0f
#define HUM_PHASE1_MIN       70.0f
#define HUM_PHASE1_MAX       85.0f
#define HUM_PHASE2_MIN       50.0f
#define HUM_PHASE2_MAX       65.0f
#define SOIL_IDEAL_MIN       55.0f
#define SOIL_IDEAL_MAX       80.0f
#define LIGHT_LEAK_THRESHOLD 150.0f  /* lux -- Phase 1 hộp xốp, không tối tuyệt đối */
#define LIGHT_PHASE2_MIN     150.0f  /* lux -- Đèn LED tối thiểu Phase 2 */
#define LIGHT_PHASE2_IDEAL   220.0f  /* lux -- Đèn LED tối ưu */

/* Timings */
#define SENSOR_READ_MS       1000    /* vòng sensor nhanh: soil/lux cập nhật ~1s */
#define DHT11_READ_MS        2000    /* DHT11 không nên đọc quá nhanh; cache vẫn publish mỗi 1s */
#define MQTT_PUBLISH_MS      1000
#define LIGHT_CTRL_MS        1000   /* Chu kỳ kiểm tra lịch đèn theo RTC */

/* NTP -> DS3231 RTC sync
 * DS3231 đang được dùng như đồng hồ local UTC+7 cho phase/light schedule.
 * Khi WiFi có Internet, ESP32 lấy giờ NTP, đổi sang UTC+7 rồi ghi vào DS3231 nếu sai lệch > 5s.
 */
#define NTP_SERVER_1              "pool.ntp.org"
#define NTP_SERVER_2              "time.google.com"
#define TZ_INFO_UTC7              "ICT-7"
#define NTP_SYNC_TIMEOUT_MS       30000
#define RTC_NTP_MAX_DRIFT_S       5
#define RTC_NTP_RETRY_MS          (10 * 60 * 1000)
#define RTC_NTP_SYNC_PERIOD_MS    (24 * 60 * 60 * 1000)

