lucas-traumen/Plant-Monitoring-CPS/esp32/esp32_v1/main/main.c
/* Local debug logs: hữu ích khi Raspberry Pi Gateway/MQTT chưa bật */
#define SENSOR_LOG_EVERY_N        5    /* log sensor mỗi ~5s; tránh ESP_LOGI dài làm nhiễu latency */
#define LIGHT_LOG_HEARTBEAT_S     30   /* log trạng thái đèn mỗi 30s nếu không đổi */
#define OFFLINE_LOG_EVERY_N       10   /* khi MQTT mất, log drop telemetry mỗi 10 gói */
#define DRAIN_MAX_PER_CYCLE       0    /* v2.9.7: không drain lại telemetry cũ để tránh nghẽn MQTT */
#define SENSOR_LATEST_QOS1_MS     10000 /* snapshot latest QoS1 retain mỗi 10s */
#define TELEMETRY_RING_ENABLE     0     /* realtime telemetry 1s không lưu offline */

/* Digital Twin direct safety timeout */
#define DT_PUMP_DEFAULT_DURATION_S   10
#define DT_PUMP_MAX_DURATION_S       15
#define DT_LIGHT_DEFAULT_DURATION_S  300
#define DT_LIGHT_MAX_DURATION_S      1800
#define ACTUATOR_STATE_PUBLISH_MS    5000

/* Phase & Light Schedule */
#define PHASE_1_DARK         1
#define PHASE_2_LIGHT        2
#define DEFAULT_PHASE        PHASE_1_DARK

/* Phase start policy
 * - Phase 0 ngâm hạt nằm ngoài firmware.
 * - planting_start_epoch = thời điểm đã gieo hạt vào đất.
 * - DB/Unity/Web Start là nguồn chuẩn; ESP32 NVS chỉ là cache local để chạy offline.
 * - Reset/mất điện/flash thường: NVS còn, không reset mốc.
 * - Nếu NVS chưa có mốc: KHÔNG tự BOOT_INIT bằng RTC hiện tại; publish valid=false và chờ Gateway SET_EPOCH.
 * - Bắt đầu lứa mới: gửi MQTT TOPIC_CMD_PLANTING_START action=SET_NOW/SET_EPOCH/CLEAR.
 */
#define DARK_PHASE_DAYS     2.0f
#define NVS_NS_PLANTING     "planting"
#define NVS_KEY_START_EPOCH "start_epoch"
#define NVS_KEY_LAST_CMD_ID "last_cmd"
#define PLANTING_CMD_ID_MAX 64
#define DIRECT_CMD_ID_MAX   64

/* Task core pinning */
#define CORE_NET            0
#define CORE_APP            1

/* Task priorities: command phải cao hơn sensor/DHT để relay không bị chờ checksum/I2C. */
#define PRIO_ACTUATOR_CMD    10
#define PRIO_ACTUATOR_STATE  8
#define PRIO_LIGHT_SCHEDULE  5
#define PRIO_SENSOR          4
#define PRIO_PUBLISH         3
#define PRIO_NTP_RTC         2

#define LIGHT_ON_HOUR_UTC7   8
#define LIGHT_OFF_HOUR_UTC7  16

/* ADS1115 Calibration */
#define SOIL_V_DRY           3.0f
#define SOIL_V_WET           1.1f


/* Sensor filter + soil fusion v2.9.2
 * Sampling target: 1 second.
 * Pipeline: ADS raw -> median samples -> voltage->% -> EMA with recovery -> Schmid-Schossmaier interval fusion.
 * v2.9.2 adds:
 * - Large-change confirm so EMA does not get stuck when sensor is plugged/unplugged.
 * - Soil presence state for OPEN_AIR_OR_DRY / ACTIVE / REMOVED_OR_EXTREME_DRY / SHORT_GND.
 * - Auto pump ON guard when soil is not reliable for plant-control.
 */
#define FILTER_TEMP_ALPHA             0.08f
#define FILTER_HUM_ALPHA              0.08f
#define FILTER_LUX_ALPHA              0.25f
#define FILTER_SOIL_ALPHA             0.10f

#define TEMP_MAX_JUMP_C               3.0f
#define HUM_MAX_JUMP_PERCENT          10.0f
#define LUX_MAX_JUMP_PERCENT          80.0f
#define SOIL_MAX_JUMP_PERCENT         25.0f
#define SOIL_JUMP_CONFIRM_COUNT       3     /* 3 mẫu liên tiếp mới chấp nhận thay đổi lớn */
#define SOIL_RECOVERY_ALPHA           0.40f /* alpha cao khi xác nhận cắm/tháo thật */

#define SOIL_MEDIAN_SAMPLES           5
#define SOIL_SAMPLE_DELAY_MS          12
#define SOIL_FUSION_ERROR_PERCENT     5.0f
#define SOIL_FUSION_FAULT_TOLERANCE   1
#define SOIL_MIN_VALID_COUNT          3
#define SOIL_ZERO_STUCK_LIMIT         30    /* 30s liên tục 0%: cảnh báo stuck/khô cực hạn */
#define SOIL_VOLTAGE_MIN_VALID       -0.05f
#define SOIL_VOLTAGE_MAX_VALID        4.10f
#define SOIL_RAIL_HIGH_V               3.25f  /* Gần 3V3: đất rất khô / chưa cắm đất / open-air */
#define SOIL_RAIL_LOW_V                0.05f  /* Gần 0V: có thể chập GND / lỗi dây */
#define SOIL_REMOVED_CONFIRM_COUNT     5      /* 5s rail-high sau khi từng ACTIVE -> nghi tháo ra */

/* ================================================================
   BIẾN TOÀN CỤC & TẠO CẤU TRÚC DỮ LIỆU
   ================================================================ */

static const char *TAG = "SPROUT";

/* WiFi & MQTT States */
static EventGroupHandle_t s_wifi_eg;
#define WIFI_CONNECTED_BIT  BIT0
#define WIFI_FAIL_BIT       BIT1

static esp_mqtt_client_handle_t s_mqtt = NULL;
static bool s_mqtt_connected = false;

/* Biến phục vụ chức năng Multi-WiFi */
static int s_current_wifi_index = 0;
static int s_wifi_retry_count   = 0;

/* Các biến logic */
static int  s_step           = 0;
static int  s_current_phase  = DEFAULT_PHASE;   /* phase ESP32 tự tính từ RTC; dùng làm fallback nếu RTC lỗi */
static int64_t s_pump_direct_until_us  = 0;     /* Digital Twin direct pump hold-off */
static int64_t s_light_direct_until_us = 0;     /* Digital Twin direct light hold-off */
static SemaphoreHandle_t s_sensor_mutex;
static SemaphoreHandle_t s_i2c_mutex;
static i2c_dev_t         s_ads_dev = {0};
static i2c_dev_t         s_rtc_dev = {0};
static bool              s_sntp_started = false;
static time_t            s_planting_start_epoch = 0;
static bool              s_planting_start_valid = false;
static char              s_last_planting_cmd_id[PLANTING_CMD_ID_MAX] = {0};

/* v2.9.4: lưu command_id/seq gần nhất của Pump/Light direct để publish actuator_state ACK chính xác.
 * Backend v1.3.0 sẽ ưu tiên ACK theo last_pump_command_id/last_light_command_id.
 */
static char              s_last_pump_cmd_id[DIRECT_CMD_ID_MAX] = {0};
static int               s_last_pump_cmd_seq = 0;
static char              s_last_light_cmd_id[DIRECT_CMD_ID_MAX] = {0};
static int               s_last_light_cmd_seq = 0;

/* v2.9.8: bảo vệ lỗi cũ khi Backend từng gửi seq=epoch_ms làm cJSON/valueint bão hòa int32.
 * Giá trị 2147483647 là dấu hiệu seq lỗi, phải bỏ qua/reset để lệnh mới epoch_seconds chạy được.
 */
#define CMD_SEQ_INT32_SATURATION_GUARD 2147483600

/* v2.9.6: MQTT callback chỉ copy command vào queue rồi return ngay.
 * actuator_cmd_task (Core 1, priority cao) xử lý relay + ACK tức thì,
 * tránh DHT11 checksum/I2C/sensor fusion làm trễ command.
 */
#define CMD_QUEUE_LEN        12
#define CMD_PAYLOAD_MAX      384

