lucas-traumen/Plant-Monitoring-CPS/esp32/esp32_v1/main/main.c
typedef enum {
    CMD_KIND_AUTO_PUMP = 1,
    CMD_KIND_DIRECT_PUMP,
    CMD_KIND_DIRECT_LIGHT,
    CMD_KIND_PLANTING_START
} cmd_kind_t;

typedef struct {
    cmd_kind_t kind;
    char payload[CMD_PAYLOAD_MAX];
    int64_t rx_us;
} cmd_msg_t;

static QueueHandle_t s_cmd_queue = NULL;

/**
 * @brief Cấu trúc bản ghi chứa toàn bộ dữ liệu Snapshot từ cảm biến
 */
typedef struct {
    float temperature;
    float air_humidity;
    float soil_pct[SOIL_CH_COUNT];          /* Soil sau median + EMA từng kênh */
    float soil_voltage[SOIL_CH_COUNT];      /* Điện áp ADS1115 sau median, để debug calibration */
    float soil_avg_raw;                     /* Trung bình cộng 4 điểm sau lọc */
    float soil_min;
    float soil_max;
    float soil_fused;                       /* Giá trị đại diện bằng Schmid-Schossmaier FTI */
    float soil_fusion_lo;
    float soil_fusion_hi;
    float soil_fusion_confidence;           /* 0.0 .. 1.0 */
    uint8_t  soil_valid_count;
    uint16_t soil_zero_streak;
    bool  soil_reliable;
    bool  soil_stuck_zero;
    bool  soil_saturated_dry;    /* Vraw sát 3V3: đất rất khô/chưa cắm đất, không tự coi là lỗi */
    bool  soil_sensor_fault;     /* Vraw bất thường hoặc stuck không phải rail-high */
    bool  soil_control_reliable; /* TRUE khi dữ liệu soil đủ tin cậy để Gateway AI điều khiển bơm */
    char  soil_presence_state[32]; /* ACTIVE / OPEN_AIR_OR_DRY / REMOVED_OR_EXTREME_DRY / SHORT_GND */
    char  soil_fusion_method[48];
    float lux;
    bool  pump_state;
    bool  light_state;
    int   phase;
    float days_after_planting;
    char  phase_source[24];    /* ESP32_RTC / RTC_ERROR */
    char  pump_mode[24];       /* AI_AUTO / DIRECT_DT */
    char  pump_reason[32];     /* GATEWAY_AI_AUTO / DT_DIRECT / DIRECT_TIMEOUT_OFF */
    char  light_mode[24];      /* AUTO_RTC / DIRECT_DT / LEGACY_CMD */
    char  light_reason[32];    /* PHASE1_LOW_LIGHT / PHASE2_DAYLIGHT_SIM / DT_DIRECT */
    bool  dht11_ok;
    bool  bh1750_ok;
    bool  ads1115_ok;
    bool  rtc_ok;
    char  iso_time[32];     /* ISO8601 từ DS3231 */
    int   wifi_rssi;
    long  uptime_s;
} sensor_data_t;

static sensor_data_t g_sensor = {0};

/* ================================================================
   RING BUFFER - Tránh mất dữ liệu (Offline Storage)
   ================================================================ */

#define RING_BUF_SIZE        64     /* Số packet tối đa lưu khi offline */
#define JSON_MAX_LEN         1536

typedef struct {
    char  json[JSON_MAX_LEN];
    bool  valid;
} ring_entry_t;

typedef struct {
    ring_entry_t buf[RING_BUF_SIZE];
    int          head;    
    int          tail;    
    int          count;   
    SemaphoreHandle_t mutex;
} ring_buf_t;

static ring_buf_t s_ring = {0};

/**
 * @brief Khởi tạo Ring Buffer để lưu trữ JSON Payload khi mất mạng
 */
static void ring_init(void) {
    s_ring.head  = 0;
    s_ring.tail  = 0;
    s_ring.count = 0;
    s_ring.mutex = xSemaphoreCreateMutex();
}

/**
 * @brief Đẩy một MQTT payload vào bộ đệm
 * @param json Chuỗi JSON cần lưu
 * @return true nếu thành công, false nếu bộ đệm bận (mutex lock failed)
 */
static bool ring_push(const char *json) {
    if (!xSemaphoreTake(s_ring.mutex, pdMS_TO_TICKS(50))) return false;

    if (s_ring.count == RING_BUF_SIZE) {
        s_ring.tail = (s_ring.tail + 1) % RING_BUF_SIZE;
        s_ring.count--;
        ESP_LOGW("RING", "Buffer đầy — ghi đè packet cũ nhất. Gateway/MQTT broker có thể chưa bật");
    }

    strlcpy(s_ring.buf[s_ring.head].json, json, JSON_MAX_LEN);
    s_ring.buf[s_ring.head].valid = true;
    s_ring.head  = (s_ring.head + 1) % RING_BUF_SIZE;
    s_ring.count++;

    int count_after_push = s_ring.count;
    xSemaphoreGive(s_ring.mutex);

    if ((count_after_push % OFFLINE_LOG_EVERY_N) == 0 || count_after_push == 1 || count_after_push == RING_BUF_SIZE) {
        ESP_LOGW("RING", "Đang lưu offline: %d/%d packet", count_after_push, RING_BUF_SIZE);
    }
    return true;
}

static bool ring_peek(char *out_json) {
    if (!xSemaphoreTake(s_ring.mutex, pdMS_TO_TICKS(50))) return false;
    bool has = (s_ring.count > 0);
    if (has) strlcpy(out_json, s_ring.buf[s_ring.tail].json, JSON_MAX_LEN);
    xSemaphoreGive(s_ring.mutex);
    return has;
}

static void ring_pop(void) {
    if (!xSemaphoreTake(s_ring.mutex, pdMS_TO_TICKS(50))) return;
    if (s_ring.count > 0) {
        s_ring.buf[s_ring.tail].valid = false;
        s_ring.tail  = (s_ring.tail + 1) % RING_BUF_SIZE;
        s_ring.count--;
    }
    xSemaphoreGive(s_ring.mutex);
}

static int ring_count(void) {
    if (!xSemaphoreTake(s_ring.mutex, pdMS_TO_TICKS(50))) return 0;
    int c = s_ring.count;
    xSemaphoreGive(s_ring.mutex);
    return c;
}

/* ================================================================
   BỘ LỌC MOVING AVERAGE DHT11
   ================================================================ */

#define DHT_FILTER_SIZE 5

typedef struct {
    float temp_buf[DHT_FILTER_SIZE];
    float hum_buf[DHT_FILTER_SIZE];
    uint8_t index;
    uint8_t count;
} dht_filter_t;

static dht_filter_t s_dht_ma = {0};

static void dht11_moving_avg(float t, float h, float *out_t, float *out_h) {
    s_dht_ma.temp_buf[s_dht_ma.index] = t;
    s_dht_ma.hum_buf[s_dht_ma.index]  = h;
    s_dht_ma.index = (s_dht_ma.index + 1) % DHT_FILTER_SIZE;
    if (s_dht_ma.count < DHT_FILTER_SIZE) s_dht_ma.count++;

    float st = 0, sh = 0;
    for (int i = 0; i < s_dht_ma.count; i++) {
        st += s_dht_ma.temp_buf[i];
        sh += s_dht_ma.hum_buf[i];
    }
    *out_t = st / s_dht_ma.count;
    *out_h = sh / s_dht_ma.count;
}

/* ================================================================
   HELPER - RTC & CẢM BIẾN
   ================================================================ */

static bool i2c_take(uint32_t timeout_ms) {
    if (!s_i2c_mutex) return true;
    return xSemaphoreTake(s_i2c_mutex, pdMS_TO_TICKS(timeout_ms)) == pdTRUE;
}

static void i2c_give(void) {
    if (s_i2c_mutex) xSemaphoreGive(s_i2c_mutex);
}

