lucas-traumen/Plant-Monitoring-CPS/esp32/esp32_v1/main/main.c
static bool rtc_get_time_safe(struct tm *out) {
    if (!out) return false;
    bool ok = false;
    if (i2c_take(2500)) {
        ok = (ds3231_get_time(&s_rtc_dev, out) == ESP_OK);
        i2c_give();
    }
    return ok;
}

static bool rtc_set_time_safe(const struct tm *in) {
    if (!in) return false;
    struct tm tmp = *in;
    bool ok = false;
    if (i2c_take(2500)) {
        ok = (ds3231_set_time(&s_rtc_dev, &tmp) == ESP_OK);
        i2c_give();
    }
    return ok;
}

static time_t tm_local_to_epoch(struct tm t) {
    t.tm_isdst = -1;
    return mktime(&t);
}

static bool rtc_get_epoch_from_ds3231(time_t *epoch_out) {
    struct tm t = {0};
    if (!rtc_get_time_safe(&t) || t.tm_year <= 100) return false;
    time_t e = tm_local_to_epoch(t);
    if (e <= 0) return false;
    if (epoch_out) *epoch_out = e;
    return true;
}

static void epoch_to_local_tm(time_t epoch, struct tm *out) {
    localtime_r(&epoch, out);
}

static void epoch_to_iso_utc7(time_t epoch, char *buf, size_t len) {
    if (!buf || len == 0) return;
    if (epoch <= 0) {
        strlcpy(buf, "INVALID", len);
        return;
    }
    struct tm t = {0};
    epoch_to_local_tm(epoch, &t);
    strftime(buf, len, "%Y-%m-%dT%H:%M:%S+07:00", &t);
}

static bool planting_start_load_from_nvs(void) {
    nvs_handle_t h;
    int64_t epoch = 0;
    esp_err_t err = nvs_open(NVS_NS_PLANTING, NVS_READONLY, &h);
    if (err != ESP_OK) return false;

    err = nvs_get_i64(h, NVS_KEY_START_EPOCH, &epoch);

    size_t cmd_len = sizeof(s_last_planting_cmd_id);
    if (nvs_get_str(h, NVS_KEY_LAST_CMD_ID, s_last_planting_cmd_id, &cmd_len) != ESP_OK) {
        s_last_planting_cmd_id[0] = '\0';
    }

    nvs_close(h);

    if (err == ESP_OK && epoch > 0) {
        s_planting_start_epoch = (time_t)epoch;
        s_planting_start_valid = true;
        char iso[32];
        epoch_to_iso_utc7(s_planting_start_epoch, iso, sizeof(iso));
        ESP_LOGI(TAG, "PLANTING: load NVS start_epoch=%lld (%s), last_cmd=%s",
                 (long long)s_planting_start_epoch, iso,
                 s_last_planting_cmd_id[0] ? s_last_planting_cmd_id : "NONE");
        return true;
    }

    return false;
}

static bool planting_start_save_to_nvs(time_t epoch, const char *cmd_id) {
    if (epoch <= 0) return false;

    nvs_handle_t h;
    esp_err_t err = nvs_open(NVS_NS_PLANTING, NVS_READWRITE, &h);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "PLANTING: nvs_open write lỗi: %s", esp_err_to_name(err));
        return false;
    }

    err = nvs_set_i64(h, NVS_KEY_START_EPOCH, (int64_t)epoch);
    if (err == ESP_OK && cmd_id && cmd_id[0]) {
        err = nvs_set_str(h, NVS_KEY_LAST_CMD_ID, cmd_id);
    }
    if (err == ESP_OK) err = nvs_commit(h);
    nvs_close(h);

    if (err == ESP_OK) {
        s_planting_start_epoch = epoch;
        s_planting_start_valid = true;
        if (cmd_id && cmd_id[0]) strlcpy(s_last_planting_cmd_id, cmd_id, sizeof(s_last_planting_cmd_id));
        char iso[32];
        epoch_to_iso_utc7(epoch, iso, sizeof(iso));
        ESP_LOGW(TAG, "PLANTING: save NVS start_epoch=%lld (%s), cmd_id=%s",
                 (long long)epoch, iso, cmd_id && cmd_id[0] ? cmd_id : "BOOT_INIT");
        return true;
    }

    ESP_LOGE(TAG, "PLANTING: save NVS lỗi: %s", esp_err_to_name(err));
    return false;
}

static bool planting_start_clear_nvs(void) {
    nvs_handle_t h;
    esp_err_t err = nvs_open(NVS_NS_PLANTING, NVS_READWRITE, &h);
    if (err != ESP_OK) return false;

    nvs_erase_key(h, NVS_KEY_START_EPOCH);
    nvs_erase_key(h, NVS_KEY_LAST_CMD_ID);
    err = nvs_commit(h);
    nvs_close(h);

    s_planting_start_epoch = 0;
    s_planting_start_valid = false;
    s_last_planting_cmd_id[0] = '\0';

    return err == ESP_OK;
}

static void rtc_sync_compile_time(void) {
    struct tm t = {0};
    if (!rtc_get_time_safe(&t)) return;

    if (t.tm_year <= 100) {   
        struct tm ct = {0};
        strptime(__DATE__ " " __TIME__, "%b %d %Y %H:%M:%S", &ct);
        if (rtc_set_time_safe(&ct)) {
            ESP_LOGW("RTC", "Đồng bộ RTC từ compile time: %s %s", __DATE__, __TIME__);
        }
    }
}

/**
 * @brief Kiểm tra system time đã hợp lệ sau NTP chưa.
 */
static bool system_time_is_valid(void) {
    time_t now = 0;
    struct tm timeinfo = {0};
    time(&now);
    localtime_r(&now, &timeinfo);
    return (timeinfo.tm_year >= (2024 - 1900));
}

/**
 * @brief Khởi động SNTP một lần. Không gọi lại nhiều lần để tránh lỗi state.
 */
static void ntp_start_once(void) {
    if (s_sntp_started) return;

    setenv("TZ", TZ_INFO_UTC7, 1);
    tzset();

    ESP_LOGI("NTP", "SNTP init: server1=%s server2=%s timezone=%s", NTP_SERVER_1, NTP_SERVER_2, TZ_INFO_UTC7);
    esp_sntp_setoperatingmode(ESP_SNTP_OPMODE_POLL);
    esp_sntp_setservername(0, NTP_SERVER_1);
    esp_sntp_setservername(1, NTP_SERVER_2);
    esp_sntp_init();

    s_sntp_started = true;
}

/**
 * @brief Chờ NTP cập nhật system time.
 */
static bool ntp_wait_time_valid(uint32_t timeout_ms) {
    int waited_ms = 0;
    while (waited_ms < (int)timeout_ms) {
        if (system_time_is_valid()) {
            time_t now = 0;
            struct tm local = {0};
            time(&now);
            localtime_r(&now, &local);
            ESP_LOGI("NTP", "System time valid: %04d-%02d-%02d %02d:%02d:%02d UTC+7",
                     local.tm_year + 1900, local.tm_mon + 1, local.tm_mday,
                     local.tm_hour, local.tm_min, local.tm_sec);
            return true;
        }
        vTaskDelay(pdMS_TO_TICKS(500));
        waited_ms += 500;
    }
    ESP_LOGW("NTP", "Timeout chờ NTP sau %ums", timeout_ms);
    return false;
}

/**
 * @brief Đồng bộ DS3231 từ system time đã được NTP cập nhật.
 * @return true nếu RTC đang đúng hoặc đã set thành công.
 */
static bool rtc_sync_from_ntp_if_needed(void) {
    if (!system_time_is_valid()) {
        ESP_LOGW("RTC", "Không sync DS3231: system time chưa hợp lệ");
        return false;
    }

    time_t now = 0;
    struct tm sys_local = {0};
    time(&now);
    localtime_r(&now, &sys_local);  /* UTC+7 do TZ_INFO_UTC7 */

    struct tm rtc_time = {0};
    bool rtc_read_ok = rtc_get_time_safe(&rtc_time);
    if (!rtc_read_ok || rtc_time.tm_year <= 100) {
        if (rtc_set_time_safe(&sys_local)) {
            ESP_LOGW("RTC", "DS3231 invalid/lỗi đọc -> set từ NTP: %04d-%02d-%02d %02d:%02d:%02d UTC+7",
                     sys_local.tm_year + 1900, sys_local.tm_mon + 1, sys_local.tm_mday,
                     sys_local.tm_hour, sys_local.tm_min, sys_local.tm_sec);
            return true;
        }
        ESP_LOGE("RTC", "Set DS3231 từ NTP thất bại");
        return false;
    }

    time_t rtc_epoch = mktime(&rtc_time);
    time_t sys_epoch = mktime(&sys_local);
    double drift_s = difftime(sys_epoch, rtc_epoch);
    if (drift_s < 0) drift_s = -drift_s;

    if (drift_s > RTC_NTP_MAX_DRIFT_S) {
        if (rtc_set_time_safe(&sys_local)) {
            ESP_LOGW("RTC", "DS3231 lệch %.0fs > %ds -> đã sync từ NTP", drift_s, RTC_NTP_MAX_DRIFT_S);
            return true;
        }
        ESP_LOGE("RTC", "DS3231 lệch %.0fs nhưng set_time thất bại", drift_s);
        return false;
    }

    ESP_LOGI("RTC", "DS3231 OK, lệch %.0fs <= %ds, không cần ghi lại", drift_s, RTC_NTP_MAX_DRIFT_S);
    return true;
}

/**
 * @brief Task định kỳ đồng bộ NTP -> DS3231.
 * - Chạy sau khi WiFi có IP.
 * - Lần đầu sync ngay sau boot nếu có mạng.
 * - Sau đó sync lại mỗi 24h để DS3231 không trôi giờ.
 */
static void ntp_rtc_sync_task(void *pv) {
    (void)pv;
    ESP_LOGI("NTP", "ntp_rtc_sync_task running on core %d", xPortGetCoreID());

    while (1) {
        EventBits_t bits = xEventGroupWaitBits(
            s_wifi_eg,
            WIFI_CONNECTED_BIT,
            pdFALSE,
            pdFALSE,
            pdMS_TO_TICKS(RTC_NTP_RETRY_MS)
        );

        if (!(bits & WIFI_CONNECTED_BIT)) {
            ESP_LOGW("NTP", "Chưa có WiFi, hoãn sync NTP -> DS3231");
            continue;
        }

        ntp_start_once();

        bool ok = false;
        if (ntp_wait_time_valid(NTP_SYNC_TIMEOUT_MS)) {
            ok = rtc_sync_from_ntp_if_needed();
        }

        if (ok) {
            vTaskDelay(pdMS_TO_TICKS(RTC_NTP_SYNC_PERIOD_MS));
        } else {
            ESP_LOGW("NTP", "Sync NTP -> DS3231 thất bại, thử lại sau %d phút", RTC_NTP_RETRY_MS / 60000);
            vTaskDelay(pdMS_TO_TICKS(RTC_NTP_RETRY_MS));
        }
    }
}

