lucas-traumen/Plant-Monitoring-CPS/esp32/esp32_v1/main/main.c
static void rtc_get_iso(char *buf, size_t len) {
    struct tm t = {0};
    if (rtc_get_time_safe(&t) && t.tm_year > 100) {
        strftime(buf, len, "%Y-%m-%dT%H:%M:%S+07:00", &t);
    } else {
        long up = (long)(esp_timer_get_time() / 1000000);
        snprintf(buf, len, "uptime:%lds", up);
    }
}

static float ads_voltage_to_pct(double v) {
    if (v >= SOIL_V_DRY) return 0.0f;
    if (v <= SOIL_V_WET) return 100.0f;
    return (SOIL_V_DRY - (float)v) / (SOIL_V_DRY - SOIL_V_WET) * 100.0f;
}


/* ================================================================
   SENSOR FILTER + SCHMID-SCHOSSMAIER SOIL FUSION v2.9.2
   ================================================================ */

typedef struct {
    bool initialized;
    float temperature;
    float air_humidity;
    bool dht_initialized;
    float lux;
    float soil_pct[SOIL_CH_COUNT];
    float soil_voltage[SOIL_CH_COUNT];
    uint8_t soil_jump_count[SOIL_CH_COUNT];
    bool soil_seen_active[SOIL_CH_COUNT];
    uint16_t soil_rail_high_streak[SOIL_CH_COUNT];
    uint16_t soil_rail_low_streak[SOIL_CH_COUNT];
    uint16_t soil_zero_streak;
    char soil_presence_state[32];
} sensor_filter_state_t;

static sensor_filter_state_t s_filter = {0};

static float clampf_local(float x, float lo, float hi) {
    if (x < lo) return lo;
    if (x > hi) return hi;
    return x;
}

static float absf_local(float x) {
    return (x < 0.0f) ? -x : x;
}

static float ema_update(float prev, float cur, float alpha) {
    return alpha * cur + (1.0f - alpha) * prev;
}

static float soil_ema_update_with_recovery(int ch, float previous, float current) {
    float diff = absf_local(current - previous);

    if (diff <= SOIL_MAX_JUMP_PERCENT) {
        s_filter.soil_jump_count[ch] = 0;
        return ema_update(previous, current, FILTER_SOIL_ALPHA);
    }

    /* Nhảy lớn 1-2 mẫu có thể là nhiễu. Nếu kéo dài >= SOIL_JUMP_CONFIRM_COUNT
     * thì xem là thay đổi thật, ví dụ cắm cảm biến vào đất hoặc tháo cảm biến ra.
     */
    if (s_filter.soil_jump_count[ch] < 255) {
        s_filter.soil_jump_count[ch]++;
    }

    if (s_filter.soil_jump_count[ch] >= SOIL_JUMP_CONFIRM_COUNT) {
        s_filter.soil_jump_count[ch] = 0;
        return ema_update(previous, current, SOIL_RECOVERY_ALPHA);
    }

    return previous;
}

static void sort_float_array(float *a, int n) {
    for (int i = 0; i < n - 1; i++) {
        for (int j = i + 1; j < n; j++) {
            if (a[j] < a[i]) {
                float t = a[i];
                a[i] = a[j];
                a[j] = t;
            }
        }
    }
}

static float median_float_array(float *a, int n) {
    sort_float_array(a, n);
    if (n <= 0) return 0.0f;
    if ((n % 2) == 1) return a[n / 2];
    return 0.5f * (a[n / 2 - 1] + a[n / 2]);
}

static float median4_float(float a, float b, float c, float d) {
    float x[4] = {a, b, c, d};
    return median_float_array(x, 4);
}

static bool soil_voltage_valid(float v) {
    return (v >= SOIL_VOLTAGE_MIN_VALID && v <= SOIL_VOLTAGE_MAX_VALID);
}

typedef struct {
    float value;
    float lo;
    float hi;
    float width;
    float confidence;
    uint8_t valid_count;
    bool reliable;
} soil_fusion_result_t;

static soil_fusion_result_t soil_fuse_schmid_schossmaier_f1(const float soil_pct[SOIL_CH_COUNT],
                                                            const float soil_voltage[SOIL_CH_COUNT]) {
    const int n = SOIL_CH_COUNT;
    const int f = SOIL_FUSION_FAULT_TOLERANCE;
    const float err = SOIL_FUSION_ERROR_PERCENT;

    float lo[SOIL_CH_COUNT] = {0};
    float hi[SOIL_CH_COUNT] = {0};
    float s[SOIL_CH_COUNT] = {0};
    uint8_t valid_count = 0;

    for (int i = 0; i < n; i++) {
        s[i] = clampf_local(soil_pct[i], 0.0f, 100.0f);
        if (soil_voltage_valid(soil_voltage[i])) valid_count++;
        lo[i] = clampf_local(s[i] - err, 0.0f, 100.0f);
        hi[i] = clampf_local(s[i] + err, 0.0f, 100.0f);
    }

    sort_float_array(lo, n);
    sort_float_array(hi, n);

    soil_fusion_result_t out = {0};
    out.valid_count = valid_count;

    /* f+1-th largest lower bound and f+1-th smallest upper bound.
     * Với n=4, f=1: lower_idx=2, upper_idx=1.
     */
    int lower_idx = n - f - 1;
    int upper_idx = f;

    out.lo = lo[lower_idx];
    out.hi = hi[upper_idx];

    if (out.lo <= out.hi) {
        float med = median4_float(s[0], s[1], s[2], s[3]);
        out.value = clampf_local(med, out.lo, out.hi);
        out.width = out.hi - out.lo;
        out.confidence = clampf_local(1.0f - (out.width / 100.0f), 0.0f, 1.0f);
        out.reliable = (valid_count >= SOIL_MIN_VALID_COUNT);
    } else {
        /* Khoảng rỗng nghĩa là các cảm biến lệch nhau quá mạnh.
         * Fallback median để không bị trung bình kéo sai, nhưng hạ confidence.
         */
        out.value = median4_float(s[0], s[1], s[2], s[3]);
        out.lo = out.value;
        out.hi = out.value;
        out.width = 100.0f;
        out.confidence = 0.0f;
        out.reliable = false;
    }

    return out;
}

static void apply_sensor_filter_and_fusion(sensor_data_t *s) {
    if (!s) return;

    if (!s_filter.initialized) {
        /* v2.9.8.3: không khởi tạo filter DHT bằng 0 khi DHT chưa đọc OK.
         * Nếu DHT lỗi lúc boot, giữ dht_initialized=false để JSON báo -1 và dht11_ok=false,
         * tránh Web/Gateway hiểu nhầm 0.0°C/0.0% là dữ liệu thật.
         */
        if (s->dht11_ok) {
            s_filter.temperature = s->temperature;
            s_filter.air_humidity = s->air_humidity;
            s_filter.dht_initialized = true;
        } else {
            s_filter.temperature = -1.0f;
            s_filter.air_humidity = -1.0f;
            s_filter.dht_initialized = false;
        }
        s_filter.lux = s->lux;
        for (int i = 0; i < SOIL_CH_COUNT; i++) {
            s_filter.soil_pct[i] = s->soil_pct[i];
            s_filter.soil_voltage[i] = s->soil_voltage[i];
            s_filter.soil_jump_count[i] = 0;
            s_filter.soil_seen_active[i] = false;
            s_filter.soil_rail_high_streak[i] = 0;
            s_filter.soil_rail_low_streak[i] = 0;
        }
        strlcpy(s_filter.soil_presence_state, "UNKNOWN", sizeof(s_filter.soil_presence_state));
        s_filter.initialized = true;
    }

    if (s->dht11_ok) {
        if (!s_filter.dht_initialized) {
            s_filter.temperature = s->temperature;
            s_filter.air_humidity = s->air_humidity;
            s_filter.dht_initialized = true;
        } else {
            if (absf_local(s->temperature - s_filter.temperature) <= TEMP_MAX_JUMP_C) {
                s_filter.temperature = ema_update(s_filter.temperature, s->temperature, FILTER_TEMP_ALPHA);
            }
            if (absf_local(s->air_humidity - s_filter.air_humidity) <= HUM_MAX_JUMP_PERCENT) {
                s_filter.air_humidity = ema_update(s_filter.air_humidity, s->air_humidity, FILTER_HUM_ALPHA);
            }
        }
    }

    if (s->bh1750_ok) {
        s_filter.lux = ema_update(s_filter.lux, s->lux, FILTER_LUX_ALPHA);
    }

