lucas-traumen/Plant-Monitoring-CPS/esp32/esp32_v1/main/main.c
    uint8_t voltage_valid_count = 0;
    uint8_t active_now_count = 0;
    uint8_t rail_high_count = 0;
    uint8_t rail_low_count = 0;
    uint8_t removed_like_count = 0;
    uint8_t seen_active_count = 0;

    bool all_zero = true;
    float sum = 0.0f;
    float min_v = 100.0f;
    float max_v = 0.0f;

    for (int i = 0; i < SOIL_CH_COUNT; i++) {
        float vraw = s->soil_voltage[i];
        bool v_valid = soil_voltage_valid(vraw);
        bool rail_high = (vraw >= SOIL_RAIL_HIGH_V);
        bool rail_low = (vraw <= SOIL_RAIL_LOW_V);
        bool active_now = v_valid && !rail_high && !rail_low;

        if (v_valid) voltage_valid_count++;
        if (rail_high) rail_high_count++;
        if (rail_low) rail_low_count++;
        if (active_now) active_now_count++;

        if (active_now) {
            s_filter.soil_seen_active[i] = true;
            s_filter.soil_rail_high_streak[i] = 0;
            s_filter.soil_rail_low_streak[i] = 0;
        } else if (rail_high) {
            if (s_filter.soil_rail_high_streak[i] < 60000) s_filter.soil_rail_high_streak[i]++;
            s_filter.soil_rail_low_streak[i] = 0;
        } else if (rail_low) {
            if (s_filter.soil_rail_low_streak[i] < 60000) s_filter.soil_rail_low_streak[i]++;
            s_filter.soil_rail_high_streak[i] = 0;
        }

        if (s_filter.soil_seen_active[i]) seen_active_count++;
        if (s_filter.soil_seen_active[i] &&
            s_filter.soil_rail_high_streak[i] >= SOIL_REMOVED_CONFIRM_COUNT) {
            removed_like_count++;
        }

        /* EMA soil có recovery:
         * - Nhảy nhỏ: EMA bình thường alpha=0.10.
         * - Nhảy lớn 1-2 mẫu: giữ giá trị cũ để chống spike.
         * - Nhảy lớn >=3 mẫu: cập nhật nhanh alpha=0.40 để không kẹt khi cắm/tháo.
         */
        s_filter.soil_pct[i] = soil_ema_update_with_recovery(i,
                                                              s_filter.soil_pct[i],
                                                              s->soil_pct[i]);
        s_filter.soil_voltage[i] = vraw;

        if (s_filter.soil_pct[i] > 0.01f) all_zero = false;
        sum += s_filter.soil_pct[i];
        if (s_filter.soil_pct[i] < min_v) min_v = s_filter.soil_pct[i];
        if (s_filter.soil_pct[i] > max_v) max_v = s_filter.soil_pct[i];
    }

    if (all_zero) {
        if (s_filter.soil_zero_streak < 60000) {
            s_filter.soil_zero_streak++;
        }
    } else {
        s_filter.soil_zero_streak = 0;
    }

    bool all_rail_high = (rail_high_count == SOIL_CH_COUNT);
    bool all_rail_low = (rail_low_count == SOIL_CH_COUNT);
    bool stuck_zero = (s_filter.soil_zero_streak >= SOIL_ZERO_STUCK_LIMIT);
    bool saturated_dry = all_zero && all_rail_high;

    char presence[32] = "UNKNOWN";
    bool sensor_fault = false;

    if (voltage_valid_count < SOIL_MIN_VALID_COUNT) {
        strlcpy(presence, "VOLTAGE_INVALID", sizeof(presence));
        sensor_fault = true;
    } else if (all_rail_low) {
        strlcpy(presence, "SHORT_GND", sizeof(presence));
        sensor_fault = true;
    } else if (active_now_count >= SOIL_MIN_VALID_COUNT) {
        strlcpy(presence, "ACTIVE", sizeof(presence));
    } else if (all_rail_high && seen_active_count >= SOIL_MIN_VALID_COUNT &&
               removed_like_count >= SOIL_MIN_VALID_COUNT) {
        strlcpy(presence, "REMOVED_OR_EXTREME_DRY", sizeof(presence));
    } else if (all_rail_high) {
        strlcpy(presence, "OPEN_AIR_OR_DRY", sizeof(presence));
    } else if (active_now_count > 0) {
        strlcpy(presence, "PARTIAL_ACTIVE", sizeof(presence));
    } else {
        strlcpy(presence, "UNSTABLE", sizeof(presence));
    }

    if (stuck_zero && !saturated_dry) {
        sensor_fault = true;
    }

    soil_fusion_result_t fusion = soil_fuse_schmid_schossmaier_f1(s_filter.soil_pct,
                                                                  s_filter.soil_voltage);

    bool control_reliable = fusion.reliable && !sensor_fault;
    /* Dữ liệu soil chỉ nên dùng cho AI bơm khi ít nhất 3/4 kênh đang ở vùng hoạt động.
     * OPEN_AIR_OR_DRY/REMOVED_OR_EXTREME_DRY không phải lúc nào là lỗi sensor,
     * nhưng không đủ chắc để tự động bật bơm trong lúc test tháo/cắm cảm biến.
     */
    if (strcmp(presence, "ACTIVE") != 0) {
        control_reliable = false;
    }

    if (s_filter.dht_initialized) {
        s->temperature = clampf_local(s_filter.temperature, 0.0f, 60.0f);
        s->air_humidity = clampf_local(s_filter.air_humidity, 0.0f, 100.0f);
    } else {
        s->temperature = -1.0f;
        s->air_humidity = -1.0f;
        s->dht11_ok = false;
    }
    s->lux = clampf_local(s_filter.lux, 0.0f, 120000.0f);

    for (int i = 0; i < SOIL_CH_COUNT; i++) {
        s->soil_pct[i] = clampf_local(s_filter.soil_pct[i], 0.0f, 100.0f);
        s->soil_voltage[i] = s_filter.soil_voltage[i];
    }

    s->soil_avg_raw = sum / SOIL_CH_COUNT;
    s->soil_min = min_v;
    s->soil_max = max_v;
    s->soil_fused = clampf_local(fusion.value, 0.0f, 100.0f);
    s->soil_fusion_lo = fusion.lo;
    s->soil_fusion_hi = fusion.hi;
    s->soil_fusion_confidence = fusion.confidence;
    s->soil_valid_count = voltage_valid_count;
    s->soil_zero_streak = s_filter.soil_zero_streak;
    s->soil_stuck_zero = stuck_zero;
    s->soil_saturated_dry = saturated_dry;
    s->soil_sensor_fault = sensor_fault;
    s->soil_control_reliable = control_reliable;
    s->soil_reliable = control_reliable;
    strlcpy(s->soil_presence_state, presence, sizeof(s->soil_presence_state));
    strlcpy(s->soil_fusion_method, "schmid_schossmaier_f1_median_ema_recovery", sizeof(s->soil_fusion_method));
}

static bool ads_read_channel_median_voltage(ads111x_mux_t mux, float *voltage_out) {
    if (!voltage_out) return false;

    float samples[SOIL_MEDIAN_SAMPLES] = {0};
    int count = 0;

    for (int k = 0; k < SOIL_MEDIAN_SAMPLES; k++) {
        if (ads111x_set_input_mux(&s_ads_dev, mux) != ESP_OK) return false;
        if (ads111x_start_conversion(&s_ads_dev) != ESP_OK) return false;

        vTaskDelay(pdMS_TO_TICKS(SOIL_SAMPLE_DELAY_MS));

        bool busy = true;
        for (int w = 0; w < 8 && busy; w++) {
            ads111x_is_busy(&s_ads_dev, &busy);
            if (busy) vTaskDelay(pdMS_TO_TICKS(2));
        }

        int16_t raw_v = 0;
        if (ads111x_get_value(&s_ads_dev, &raw_v) == ESP_OK) {
            samples[count++] = (float)((double)raw_v * 4.096 / 32767.0);
        }
    }

    if (count <= 0) return false;
    *voltage_out = median_float_array(samples, count);
    return true;
}

static bool mqtt_topic_match(esp_mqtt_event_handle_t ev, const char *topic) {
    size_t topic_len = strlen(topic);
    return (ev->topic_len == topic_len) &&
           (strncmp(ev->topic, topic, topic_len) == 0);
}

