lucas-traumen/Plant-Monitoring-CPS/esp32/esp32_v1/main/main.c
static bool rtc_get_phase_from_planting_time(int *phase_out,
                                             float *days_out,
                                             char *source,
                                             size_t source_len) {
    struct tm now = {0};
    if (!rtc_get_time_safe(&now) || now.tm_year <= 100) {
        if (phase_out) *phase_out = s_current_phase;
        if (days_out)  *days_out = -1.0f;
        if (source) strlcpy(source, "RTC_ERROR", source_len);
        return false;
    }

    if (!s_planting_start_valid || s_planting_start_epoch <= 0) {
        if (phase_out) *phase_out = s_current_phase;
        if (days_out)  *days_out = -1.0f;
        if (source) strlcpy(source, "NVS_NO_START", source_len);
        return false;
    }

    time_t now_epoch = tm_local_to_epoch(now);
    double diff_s = difftime(now_epoch, s_planting_start_epoch);
    float days = (float)(diff_s / 86400.0);
    if (days < 0.0f) days = 0.0f;

    int phase = (days < DARK_PHASE_DAYS) ? PHASE_1_DARK : PHASE_2_LIGHT;

    if (phase_out) *phase_out = phase;
    if (days_out)  *days_out = days;
    if (source) strlcpy(source, "ESP32_RTC_NVS", source_len);
    return true;
}

static bool rtc_get_hour_utc7(int *hour_out) {
    struct tm t = {0};
    if (rtc_get_time_safe(&t) && t.tm_year > 100) {
        *hour_out = t.tm_hour;
        return true;
    }
    return false;
}

static bool light_should_be_on_by_schedule(int phase, int hour_utc7) {
    if (phase != PHASE_2_LIGHT) {
        return false;   /* Phase 1: luôn tối */
    }

    if (LIGHT_ON_HOUR_UTC7 < LIGHT_OFF_HOUR_UTC7) {
        return (hour_utc7 >= LIGHT_ON_HOUR_UTC7 &&
                hour_utc7 <  LIGHT_OFF_HOUR_UTC7);
    }

    /* Trường hợp lịch qua nửa đêm, ví dụ 20h -> 6h */
    return (hour_utc7 >= LIGHT_ON_HOUR_UTC7 ||
            hour_utc7 <  LIGHT_OFF_HOUR_UTC7);
}

static int build_json(char *buf, size_t buf_len, const sensor_data_t *s, int step) {
    return snprintf(buf, buf_len,
        "{"
        "\"node_id\":\"%s\","
        "\"fw\":\"%s\","
        "\"timestamp\":\"%s\","
        "\"step\":%d,"
        "\"uptime_s\":%ld,"
        "\"phase\":%d,"
        "\"phase_source\":\"%s\","
        "\"days_after_planting\":%.3f,"
        "\"planting_start_epoch\":%lld,"
        "\"planting_start_valid\":%s,"
        "\"sensor\":{"
            "\"temperature\":%.1f,"
            "\"air_humidity\":%.1f,"
            "\"lux\":%.2f,"
            "\"soil_moisture_avg\":%.1f,"
            "\"soil_moisture_mean\":%.1f,"
            "\"soil_moisture_fused\":%.1f,"
            "\"soil_moisture_min\":%.1f,"
            "\"soil_moisture_max\":%.1f,"
            "\"soil_moisture_raw\":{"
                "\"s1\":%.1f,\"s2\":%.1f,\"s3\":%.1f,\"s4\":%.1f"
            "},"
            "\"soil_voltage_raw\":{"
                "\"v1\":%.3f,\"v2\":%.3f,\"v3\":%.3f,\"v4\":%.3f"
            "},"
            "\"soil_fusion\":{"
                "\"method\":\"%s\","
                "\"lo\":%.1f,"
                "\"hi\":%.1f,"
                "\"confidence\":%.2f,"
                "\"valid_count\":%u,"
                "\"presence_state\":\"%s\","
                "\"control_reliable\":%s,"
                "\"reliable\":%s,"
                "\"stuck_zero\":%s,"
                "\"saturated_dry\":%s,"
                "\"sensor_fault\":%s,"
                "\"zero_streak\":%u"
            "}"
        "},"
        "\"status\":{"
            "\"wifi_rssi\":%d,"
            "\"dht11_ok\":%s,"
            "\"bh1750_ok\":%s,"
            "\"ads1115_ok\":%s,"
            "\"rtc_ok\":%s,"
            "\"pump_on\":%s,"
            "\"pump_mode\":\"%s\","
            "\"pump_reason\":\"%s\","
            "\"light_on\":%s,"
            "\"light_mode\":\"%s\","
            "\"light_reason\":\"%s\""
        "}"
        "}",
        NODE_ID, FW_VERSION, s->iso_time, step,
        s->uptime_s, s->phase,
        s->phase_source[0] ? s->phase_source : "UNKNOWN",
        s->days_after_planting,
        (long long)s_planting_start_epoch,
        s_planting_start_valid ? "true" : "false",
        s->temperature, s->air_humidity, s->lux,
        s->soil_fused, s->soil_avg_raw, s->soil_fused, s->soil_min, s->soil_max,
        s->soil_pct[0], s->soil_pct[1], s->soil_pct[2], s->soil_pct[3],
        s->soil_voltage[0], s->soil_voltage[1], s->soil_voltage[2], s->soil_voltage[3],
        s->soil_fusion_method[0] ? s->soil_fusion_method : "none",
        s->soil_fusion_lo, s->soil_fusion_hi, s->soil_fusion_confidence,
        (unsigned)s->soil_valid_count,
        s->soil_presence_state[0] ? s->soil_presence_state : "UNKNOWN",
        s->soil_control_reliable ? "true" : "false",
        s->soil_reliable ? "true" : "false",
        s->soil_stuck_zero ? "true" : "false",
        s->soil_saturated_dry ? "true" : "false",
        s->soil_sensor_fault ? "true" : "false",
        (unsigned)s->soil_zero_streak,
        s->wifi_rssi,
        s->dht11_ok   ? "true" : "false",
        s->bh1750_ok  ? "true" : "false",
        s->ads1115_ok ? "true" : "false",
        s->rtc_ok     ? "true" : "false",
        s->pump_state ? "true" : "false",
        s->pump_mode[0] ? s->pump_mode : "AI_AUTO",
        s->pump_reason[0] ? s->pump_reason : "UNKNOWN",
        s->light_state ? "true" : "false",
        s->light_mode[0] ? s->light_mode : "AUTO_RTC",
        s->light_reason[0] ? s->light_reason : "UNKNOWN"
    );
}

static const char *phase_to_text(int phase) {
    switch (phase) {
        case PHASE_1_DARK:  return "PHASE1_DARK";
        case PHASE_2_LIGHT: return "PHASE2_LIGHT";
        default:            return "UNKNOWN";
    }
}

static float soil_avg_from_snapshot(const sensor_data_t *s) {
    if (!s) return 0.0f;
    return s->soil_fused;
}


/* ================================================================
   DIGITAL TWIN DIRECT CONTROL HELPERS
   ================================================================ */

static bool pump_direct_active(void) {
    return (s_pump_direct_until_us > 0 && esp_timer_get_time() < s_pump_direct_until_us);
}

static bool light_direct_active(void) {
    return (s_light_direct_until_us > 0 && esp_timer_get_time() < s_light_direct_until_us);
}

