lucas-traumen/Plant-Monitoring-CPS/esp32/esp32_v1/main/main.c
static void mqtt_data_to_cstr(esp_mqtt_event_handle_t ev, char *out, size_t out_len) {
    if (!out || out_len == 0) return;
    size_t n = (ev->data_len < (int)(out_len - 1)) ? ev->data_len : (out_len - 1);
    memcpy(out, ev->data, n);
    out[n] = '\0';
}

static bool json_get_string_value(const char *json, const char *key, char *out, size_t out_len) {
    if (!json || !key || !out || out_len == 0) return false;
    char pattern[32];
    snprintf(pattern, sizeof(pattern), "\"%s\"", key);
    const char *p = strstr(json, pattern);
    if (!p) return false;
    p = strchr(p + strlen(pattern), ':');
    if (!p) return false;
    p++;
    while (*p == ' ' || *p == '\t') p++;
    if (*p != '"') return false;
    p++;
    size_t i = 0;
    while (*p && *p != '"' && i + 1 < out_len) {
        out[i++] = *p++;
    }
    out[i] = '\0';
    return i > 0;
}

static int json_get_int_value(const char *json, const char *key, int default_value) {
    if (!json || !key) return default_value;
    char pattern[32];
    snprintf(pattern, sizeof(pattern), "\"%s\"", key);
    const char *p = strstr(json, pattern);
    if (!p) return default_value;
    p = strchr(p + strlen(pattern), ':');
    if (!p) return default_value;
    p++;
    while (*p == ' ' || *p == '\t') p++;
    return atoi(p);
}

static bool parse_on_off_command(const char *payload, bool default_on) {
    char state[16] = {0};
    if (json_get_string_value(payload, "state", state, sizeof(state)) ||
        json_get_string_value(payload, "cmd", state, sizeof(state)) ||
        json_get_string_value(payload, "action", state, sizeof(state))) {
        return (strcasecmp(state, "ON") == 0 ||
                strcasecmp(state, "PUMP_ON") == 0 ||
                strcasecmp(state, "LIGHT_ON") == 0 ||
                strcmp(state, "1") == 0 ||
                strcasecmp(state, "TRUE") == 0);
    }

    if (strstr(payload, "ON") || strstr(payload, "on") || strstr(payload, "true") || strstr(payload, "1")) {
        return true;
    }
    if (strstr(payload, "OFF") || strstr(payload, "off") || strstr(payload, "false") || strstr(payload, "0")) {
        return false;
    }
    return default_on;
}

static int parse_duration_s(const char *payload, int default_s, int max_s) {
    int d = json_get_int_value(payload, "duration_s", -1);
    if (d < 0) d = json_get_int_value(payload, "duration", -1);
    if (d < 0) d = default_s;
    if (d < 0) d = 0;
    if (d > max_s) d = max_s;
    return d;
}

static int64_t json_get_int64_value(const char *json, const char *key, int64_t default_value) {
    if (!json || !key) return default_value;
    char pattern[40];
    snprintf(pattern, sizeof(pattern), "\"%s\"", key);
    const char *p = strstr(json, pattern);
    if (!p) return default_value;
    p = strchr(p + strlen(pattern), ':');
    if (!p) return default_value;
    p++;
    while (*p == ' ' || *p == '\t' || *p == '"') p++;
    return strtoll(p, NULL, 10);
}

static int64_t current_unix_ms_if_valid(void) {
    time_t now_s = time(NULL);
    /* > 2023-11: chỉ check TTL khi hệ thống/RTC đã có giờ hợp lệ. */
    if (now_s < 1700000000) return 0;
    return ((int64_t)now_s) * 1000LL;
}

static bool command_payload_expired(const char *payload, const char *cmd_id) {
    int64_t now_ms = current_unix_ms_if_valid();
    if (now_ms <= 0) return false;

    int64_t expires_ms = json_get_int64_value(payload, "expires_at_ms", 0);
    if (expires_ms > 0 && now_ms > expires_ms) {
        ESP_LOGW(TAG, "Drop expired command cmd_id=%s now_ms=%lld expires_at_ms=%lld",
                 cmd_id && cmd_id[0] ? cmd_id : "NONE",
                 (long long)now_ms, (long long)expires_ms);
        return true;
    }

    int64_t created_ms = json_get_int64_value(payload, "created_at_ms", 0);
    int ttl_s = json_get_int_value(payload, "ttl_s", 0);
    if (created_ms > 0 && ttl_s > 0 && now_ms > created_ms + ((int64_t)ttl_s * 1000LL)) {
        ESP_LOGW(TAG, "Drop TTL command cmd_id=%s now_ms=%lld created_at_ms=%lld ttl_s=%d",
                 cmd_id && cmd_id[0] ? cmd_id : "NONE",
                 (long long)now_ms, (long long)created_ms, ttl_s);
        return true;
    }
    return false;
}

static bool cmd_seq_is_saturated_int32(int seq) {
    return seq >= CMD_SEQ_INT32_SATURATION_GUARD;
}

static void reset_saturated_last_seq_if_needed(const char *target) {
    if (strcasecmp(target, "pump") == 0) {
        if (cmd_seq_is_saturated_int32(s_last_pump_cmd_seq)) {
            ESP_LOGW(TAG, "Reset saturated last_pump_seq=%d -> 0", s_last_pump_cmd_seq);
            s_last_pump_cmd_seq = 0;
            s_last_pump_cmd_id[0] = '\0';
        }
    } else if (strcasecmp(target, "light") == 0) {
        if (cmd_seq_is_saturated_int32(s_last_light_cmd_seq)) {
            ESP_LOGW(TAG, "Reset saturated last_light_seq=%d -> 0", s_last_light_cmd_seq);
            s_last_light_cmd_seq = 0;
            s_last_light_cmd_id[0] = '\0';
        }
    }
}

static bool incoming_seq_is_invalid_saturated(int seq, const char *cmd_id, const char *target) {
    if (cmd_seq_is_saturated_int32(seq)) {
        ESP_LOGW(TAG, "Drop saturated %s command seq=%d cmd_id=%s — backend cũ/retained cũ",
                 target ? target : "UNKNOWN", seq,
                 cmd_id && cmd_id[0] ? cmd_id : "NONE");
        return true;
    }
    return false;
}

static bool planting_command_is_duplicate(const char *cmd_id) {
    return (cmd_id && cmd_id[0] && s_last_planting_cmd_id[0] &&
            strncmp(cmd_id, s_last_planting_cmd_id, sizeof(s_last_planting_cmd_id)) == 0);
}

static void publish_planting_status(const char *event, const char *cmd_id, const char *status, const char *reason) {
    if (!s_mqtt_connected || !s_mqtt) return;

    char start_iso[32];
    char now_iso[32];
    epoch_to_iso_utc7(s_planting_start_epoch, start_iso, sizeof(start_iso));
    rtc_get_iso(now_iso, sizeof(now_iso));

    char payload[512];
    int len = snprintf(payload, sizeof(payload),
        "{"
        "\"node_id\":\"%s\","
        "\"event\":\"%s\","
        "\"target\":\"planting_start\","
        "\"command_id\":\"%s\","
        "\"status\":\"%s\","
        "\"source\":\"ESP32_NVS\","
        "\"planting_start_epoch\":%lld,"
        "\"planting_start_time\":\"%s\","
        "\"planting_start_valid\":%s,"
        "\"reason\":\"%s\","
        "\"timestamp\":\"%s\""
        "}",
        NODE_ID,
        event ? event : "planting_start_status",
        cmd_id ? cmd_id : "",
        status ? status : "OK",
        (long long)s_planting_start_epoch,
        start_iso,
        s_planting_start_valid ? "true" : "false",
        reason ? reason : "",
        now_iso);

    if (len > 0) esp_mqtt_client_publish(s_mqtt, TOPIC_STATUS_ESP32, payload, len, MQTT_QOS_STATUS, 0);
}

static bool planting_start_init_from_nvs_or_rtc(void) {
    /* v2.9.3: NVS chỉ là cache local.
     * Không tự tạo start_epoch=now khi NVS rỗng, vì làm che lỗi đồng bộ Unity/DB -> Gateway -> ESP32.
     * Gateway sẽ reconcile DB desired_epoch với ESP32 actual_epoch và gửi SET_EPOCH khi cần.
     */
    if (planting_start_load_from_nvs()) return true;

