lucas-traumen/Plant-Monitoring-CPS/esp32/esp32_v1/main/main.c
    s_planting_start_epoch = 0;
    s_planting_start_valid = false;
    s_last_planting_cmd_id[0] = '\0';
    ESP_LOGW(TAG, "PLANTING: NVS chưa có start_epoch -> valid=false, chờ Gateway/Unity SET_EPOCH");
    return false;
}

static bool planting_start_save_verified(time_t epoch, const char *cmd_id) {
    if (epoch <= 0) return false;

    if (!planting_start_save_to_nvs(epoch, cmd_id)) {
        return false;
    }

    /* Đọc lại NVS để xác nhận đã commit đúng epoch. */
    s_planting_start_epoch = 0;
    s_planting_start_valid = false;
    s_last_planting_cmd_id[0] = '\0';

    if (!planting_start_load_from_nvs()) {
        ESP_LOGE(TAG, "PLANTING: verify failed, không đọc lại được NVS sau khi save");
        return false;
    }

    if (!s_planting_start_valid || s_planting_start_epoch != epoch) {
        ESP_LOGE(TAG, "PLANTING: verify mismatch, expected=%lld actual=%lld",
                 (long long)epoch, (long long)s_planting_start_epoch);
        return false;
    }

    return true;
}

static void handle_planting_start_payload(const char *payload) {
    char action[24] = {0};
    char cmd_id[PLANTING_CMD_ID_MAX] = {0};
    char reason[64] = {0};

    json_get_string_value(payload, "command_id", cmd_id, sizeof(cmd_id));
    if (!cmd_id[0]) json_get_string_value(payload, "id", cmd_id, sizeof(cmd_id));
    if (!cmd_id[0]) snprintf(cmd_id, sizeof(cmd_id), "mqtt-%lld", (long long)(esp_timer_get_time() / 1000));

    if (planting_command_is_duplicate(cmd_id)) {
        ESP_LOGW(TAG, "PLANTING: bỏ qua command trùng cmd_id=%s", cmd_id);
        publish_planting_status("planting_start_duplicate", cmd_id, "DUPLICATE", "duplicate_command_id");
        return;
    }

    if (!json_get_string_value(payload, "action", action, sizeof(action))) strlcpy(action, "SET_NOW", sizeof(action));
    json_get_string_value(payload, "reason", reason, sizeof(reason));

    if (strcasecmp(action, "SET_NOW") == 0) {
        time_t now_epoch = 0;
        if (!rtc_get_epoch_from_ds3231(&now_epoch)) {
            ESP_LOGE(TAG, "PLANTING: SET_NOW thất bại vì RTC invalid");
            publish_planting_status("planting_start_error", cmd_id, "ERROR", "rtc_invalid");
            return;
        }
        if (planting_start_save_verified(now_epoch, cmd_id)) {
            publish_planting_status("planting_start_updated", cmd_id, "DONE", reason[0] ? reason : "SET_NOW");
        } else {
            publish_planting_status("planting_start_error", cmd_id, "ERROR", "nvs_save_verify_failed");
        }
    } else if (strcasecmp(action, "SET_EPOCH") == 0) {
        int64_t epoch = json_get_int64_value(payload, "planting_start_epoch", 0);
        if (epoch <= 0) epoch = json_get_int64_value(payload, "epoch", 0);
        if (epoch <= 0) {
            publish_planting_status("planting_start_error", cmd_id, "ERROR", "missing_epoch");
            return;
        }
        if (planting_start_save_verified((time_t)epoch, cmd_id)) {
            publish_planting_status("planting_start_updated", cmd_id, "DONE", reason[0] ? reason : "SET_EPOCH");
        } else {
            publish_planting_status("planting_start_error", cmd_id, "ERROR", "nvs_save_verify_failed");
        }
    } else if (strcasecmp(action, "CLEAR") == 0) {
        if (planting_start_clear_nvs()) {
            publish_planting_status("planting_start_cleared", cmd_id, "DONE", reason[0] ? reason : "CLEAR");
        } else {
            publish_planting_status("planting_start_error", cmd_id, "ERROR", "nvs_clear_failed");
        }
    } else if (strcasecmp(action, "GET") == 0) {
        publish_planting_status("planting_start_current", cmd_id, "DONE", reason[0] ? reason : "GET");
    } else {
        ESP_LOGW(TAG, "PLANTING: action không hỗ trợ: %s", action);
        publish_planting_status("planting_start_error", cmd_id, "ERROR", "unsupported_action");
    }
}

static void publish_actuator_state(const char *event_reason) {
    if (!s_mqtt_connected || !s_mqtt) return;

    sensor_data_t snap;
    if (xSemaphoreTake(s_sensor_mutex, pdMS_TO_TICKS(100)) == pdTRUE) {
        snap = g_sensor;
        xSemaphoreGive(s_sensor_mutex);
    } else {
        return;
    }

    char ts[32] = {0};
    rtc_get_iso(ts, sizeof(ts));

    char payload[768];
    int len = snprintf(payload, sizeof(payload),
        "{"
        "\"node_id\":\"%s\","
        "\"timestamp\":\"%s\","
        "\"event\":\"%s\","
        "\"last_pump_command_id\":\"%s\","
        "\"last_pump_seq\":%d,"
        "\"last_light_command_id\":\"%s\","
        "\"last_light_seq\":%d,"
        "\"pump\":{\"state\":\"%s\",\"mode\":\"%s\",\"reason\":\"%s\"},"
        "\"light\":{\"state\":\"%s\",\"mode\":\"%s\",\"reason\":\"%s\"}"
        "}",
        NODE_ID, ts, event_reason ? event_reason : "STATE",
        s_last_pump_cmd_id[0] ? s_last_pump_cmd_id : "",
        s_last_pump_cmd_seq,
        s_last_light_cmd_id[0] ? s_last_light_cmd_id : "",
        s_last_light_cmd_seq,
        snap.pump_state ? "ON" : "OFF",
        snap.pump_mode[0] ? snap.pump_mode : "AI_AUTO",
        snap.pump_reason[0] ? snap.pump_reason : "UNKNOWN",
        snap.light_state ? "ON" : "OFF",
        snap.light_mode[0] ? snap.light_mode : "AUTO_RTC",
        snap.light_reason[0] ? snap.light_reason : "UNKNOWN");

    if (len > 0) {
        esp_mqtt_client_publish(s_mqtt, TOPIC_ACTUATOR_STATE, payload, len, MQTT_QOS_STATUS, 0);
    }
}

static void set_pump_state(bool on, const char *mode, const char *reason) {
    gpio_set_level(RELAY_PUMP_GPIO, on ? 1 : 0);
    if (xSemaphoreTake(s_sensor_mutex, pdMS_TO_TICKS(100)) == pdTRUE) {
        g_sensor.pump_state = on;
        strlcpy(g_sensor.pump_mode, mode ? mode : "AI_AUTO", sizeof(g_sensor.pump_mode));
        strlcpy(g_sensor.pump_reason, reason ? reason : "UNKNOWN", sizeof(g_sensor.pump_reason));
        xSemaphoreGive(s_sensor_mutex);
    }
}

static void set_light_state(bool on, const char *mode, const char *reason) {
    gpio_set_level(RELAY_LIGHT_GPIO, on ? 1 : 0);
    if (xSemaphoreTake(s_sensor_mutex, pdMS_TO_TICKS(100)) == pdTRUE) {
        g_sensor.light_state = on;
        strlcpy(g_sensor.light_mode, mode ? mode : "AUTO_RTC", sizeof(g_sensor.light_mode));
        strlcpy(g_sensor.light_reason, reason ? reason : "UNKNOWN", sizeof(g_sensor.light_reason));
        xSemaphoreGive(s_sensor_mutex);
    }
}

static void handle_auto_pump_payload(const char *payload) {
    if (pump_direct_active()) {
        ESP_LOGW(TAG, "Ignore Gateway auto pump while direct command active: %s", payload);
        return;
    }

    bool on = parse_on_off_command(payload, false);

    if (on) {
        bool soil_ok_for_control = true;
        char presence[32] = "UNKNOWN";
        if (xSemaphoreTake(s_sensor_mutex, pdMS_TO_TICKS(100)) == pdTRUE) {
            soil_ok_for_control = g_sensor.soil_control_reliable;
            strlcpy(presence,
                    g_sensor.soil_presence_state[0] ? g_sensor.soil_presence_state : "UNKNOWN",
                    sizeof(presence));
            xSemaphoreGive(s_sensor_mutex);
        }

