lucas-traumen/Plant-Monitoring-CPS/esp32/esp32_v1/main/main.c
    int best_index = -1;
    int best_rssi = -999;

    for (int i = 0; i < ap_count; i++) {
        const char *ssid = (const char *)ap_records[i].ssid;
        const char *print_ssid = (ssid && ssid[0]) ? ssid : "<hidden>";
        ESP_LOGI(TAG, "  [%02d] SSID=%s | RSSI=%d | CH=%d | AUTH=%s",
                 i + 1, print_ssid, ap_records[i].rssi,
                 ap_records[i].primary, wifi_auth_to_text(ap_records[i].authmode));

        for (int k = 0; k < (int)WIFI_NETWORK_COUNT; k++) {
            if (ssid && strcmp(ssid, WIFI_NETWORKS[k].ssid) == 0) {
                if (ap_records[i].rssi > best_rssi) {
                    best_rssi = ap_records[i].rssi;
                    best_index = k;
                }
            }
        }
    }

    if (best_index >= 0) {
        ESP_LOGI(TAG, "Chọn WiFi quen thuộc mạnh nhất: %s (RSSI=%d)",
                 WIFI_NETWORKS[best_index].ssid, best_rssi);
        return best_index;
    }

    ESP_LOGW(TAG, "Không thấy SSID quen thuộc trong scan — vẫn thử connect trực tiếp SSID hiện tại: %s",
             WIFI_NETWORKS[s_current_wifi_index].ssid);
    return s_current_wifi_index;
}

static void wifi_connect_current(void) {
    esp_err_t err = esp_wifi_connect();
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "esp_wifi_connect(%s) lỗi mềm: %s",
                 WIFI_NETWORKS[s_current_wifi_index].ssid, esp_err_to_name(err));
    }
}

/**
 * @brief Chuyển đổi sang điểm truy cập WiFi tiếp theo trong danh sách, không crash nếu set_config lỗi.
 */
static void wifi_switch_to_next_network(void) {
    int next = (s_current_wifi_index + 1) % WIFI_NETWORK_COUNT;
    s_wifi_retry_count = 0;

    ESP_LOGI(TAG, "==> Đổi sang WiFi tiếp theo: %s", WIFI_NETWORKS[next].ssid);
    if (wifi_apply_config(next)) {
        wifi_connect_current();
    }

    /* Nếu đã duyệt hết 1 vòng mảng WiFi mà vẫn chưa kết nối, báo offline nhưng vẫn tiếp tục retry. */
    if (next == 0) {
        xEventGroupSetBits(s_wifi_eg, WIFI_FAIL_BIT);
    }
}

static void wifi_event_handler(void *arg, esp_event_base_t base,
                                int32_t id, void *data) {
    if (base == WIFI_EVENT && id == WIFI_EVENT_STA_START) {
        ESP_LOGI(TAG, "WiFi STA started");
    } else if (base == WIFI_EVENT && id == WIFI_EVENT_STA_DISCONNECTED) {
        s_mqtt_connected = false;
        xEventGroupClearBits(s_wifi_eg, WIFI_CONNECTED_BIT);

        wifi_event_sta_disconnected_t *event = (wifi_event_sta_disconnected_t *)data;
        uint8_t reason = event ? event->reason : 0;

        ESP_LOGW(TAG, "WiFi disconnected | SSID=%s | reason=%u(%s) | retry=%d/%d",
                 WIFI_NETWORKS[s_current_wifi_index].ssid,
                 reason, wifi_reason_to_text(reason),
                 s_wifi_retry_count, WIFI_MAX_RETRY);

        if (s_wifi_retry_count < WIFI_MAX_RETRY) {
            s_wifi_retry_count++;
            ESP_LOGW(TAG, "Thử kết nối lại %d/%d với SSID: %s",
                     s_wifi_retry_count, WIFI_MAX_RETRY,
                     WIFI_NETWORKS[s_current_wifi_index].ssid);
            wifi_connect_current();
        } else {
            ESP_LOGE(TAG, "Kết nối [%s] thất bại sau %d lần — đổi mạng",
                     WIFI_NETWORKS[s_current_wifi_index].ssid, WIFI_MAX_RETRY);
            wifi_switch_to_next_network();
        }
    } else if (base == IP_EVENT && id == IP_EVENT_STA_GOT_IP) {
        ip_event_got_ip_t *event = (ip_event_got_ip_t *) data;
        ESP_LOGI(TAG, "WiFi connected | IP=" IPSTR " | GW=" IPSTR " | SSID=%s",
                 IP2STR(&event->ip_info.ip), IP2STR(&event->ip_info.gw),
                 WIFI_NETWORKS[s_current_wifi_index].ssid);
        s_wifi_retry_count = 0;
        xEventGroupClearBits(s_wifi_eg, WIFI_FAIL_BIT);
        xEventGroupSetBits(s_wifi_eg, WIFI_CONNECTED_BIT);
    }
}

static void wifi_init(void) {
    s_wifi_eg = xEventGroupCreate();
    ESP_ERROR_CHECK(esp_netif_init());
    ESP_ERROR_CHECK(esp_event_loop_create_default());
    esp_netif_create_default_wifi_sta();

    wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
    ESP_ERROR_CHECK(esp_wifi_init(&cfg));

    esp_event_handler_instance_register(WIFI_EVENT, ESP_EVENT_ANY_ID,
                                        wifi_event_handler, NULL, NULL);
    esp_event_handler_instance_register(IP_EVENT, IP_EVENT_STA_GOT_IP,
                                        wifi_event_handler, NULL, NULL);

    ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_STA));

    /* Việt Nam dùng channel 1-13. Nếu để mặc định US, mạng ở channel 12/13 có thể không thấy. */
    wifi_country_t country = {
        .cc = "VN",
        .schan = 1,
        .nchan = 13,
        .policy = WIFI_COUNTRY_POLICY_MANUAL,
    };
    esp_err_t country_err = esp_wifi_set_country(&country);
    if (country_err != ESP_OK) {
        ESP_LOGW(TAG, "set_country(VN) lỗi mềm: %s", esp_err_to_name(country_err));
    }

    /* v2.9.8: tăng ổn định WiFi/MQTT khi ESP32 gửi nhận liên tục.
     * - WIFI_PS_NONE: không ngủ WiFi, giảm No PING_RESP / MQTT disconnect.
     * - max_tx_power=78 tương đương 19.5 dBm, mức cao nhất thường dùng của ESP32.
     */
    esp_err_t ps_err = esp_wifi_set_ps(WIFI_PS_NONE);
    if (ps_err != ESP_OK) {
        ESP_LOGW(TAG, "esp_wifi_set_ps(WIFI_PS_NONE) lỗi mềm: %s", esp_err_to_name(ps_err));
    } else {
        ESP_LOGI(TAG, "WiFi power save: OFF");
    }

    esp_err_t txp_err = esp_wifi_set_max_tx_power(78);
    if (txp_err != ESP_OK) {
        ESP_LOGW(TAG, "esp_wifi_set_max_tx_power(78) lỗi mềm: %s", esp_err_to_name(txp_err));
    } else {
        ESP_LOGI(TAG, "WiFi TX power: max request=78/19.5dBm");
    }

    /* Đặt cấu hình mặc định trước khi start. */
    wifi_apply_config(s_current_wifi_index);

    ESP_ERROR_CHECK(esp_wifi_start());
    vTaskDelay(pdMS_TO_TICKS(500));

    /* Scan chỉ để chọn SSID tốt hơn và debug. Nếu scan timeout thì không crash. */
    int selected = wifi_scan_select_best_known();
    wifi_apply_config(selected);
    wifi_connect_current();

    EventBits_t bits = xEventGroupWaitBits(s_wifi_eg,
        WIFI_CONNECTED_BIT | WIFI_FAIL_BIT, pdFALSE, pdFALSE,
        pdMS_TO_TICKS(WIFI_BOOT_WAIT_MS));

    if (bits & WIFI_CONNECTED_BIT) {
        ESP_LOGI(TAG, "Boot WiFi hoàn tất");
    } else {
        ESP_LOGW(TAG, "WiFi boot chưa kết nối sau %dms — chuyển sang Offline, task WiFi vẫn tiếp tục retry",
                 WIFI_BOOT_WAIT_MS);
    }
}


/* ================================================================
   ACTUATOR COMMAND QUEUE — REALTIME CONTROL PATH v2.9.6
   ================================================================ */

