lucas-traumen/Plant-Monitoring-CPS/esp32/esp32_v1/main/main.c
static void enqueue_mqtt_command(cmd_kind_t kind, esp_mqtt_event_handle_t ev) {
    if (!s_cmd_queue || !ev || !ev->data) return;

    cmd_msg_t msg = {0};
    msg.kind = kind;
    msg.rx_us = esp_timer_get_time();

    size_t n = (ev->data_len < (int)(sizeof(msg.payload) - 1)) ? ev->data_len : (sizeof(msg.payload) - 1);
    memcpy(msg.payload, ev->data, n);
    msg.payload[n] = '\0';

    if (xQueueSend(s_cmd_queue, &msg, 0) != pdTRUE) {
        cmd_msg_t dropped;
        (void)xQueueReceive(s_cmd_queue, &dropped, 0);
        if (xQueueSend(s_cmd_queue, &msg, 0) != pdTRUE) {
            ESP_LOGE(TAG, "CMD_QUEUE full: drop newest kind=%d payload=%s", (int)kind, msg.payload);
        } else {
            ESP_LOGW(TAG, "CMD_QUEUE full: dropped oldest, queued newest kind=%d", (int)kind);
        }
    }
}

static void actuator_cmd_task(void *pv) {
    ESP_LOGI(TAG, "actuator_cmd_task running on core %d prio=%d queue_len=%d",
             xPortGetCoreID(), (int)uxTaskPriorityGet(NULL), CMD_QUEUE_LEN);

    cmd_msg_t msg;
    while (1) {
        if (xQueueReceive(s_cmd_queue, &msg, portMAX_DELAY) != pdTRUE) continue;

        int64_t q_delay_ms = (esp_timer_get_time() - msg.rx_us) / 1000LL;
        if (q_delay_ms > 100) {
            ESP_LOGW(TAG, "CMD_QUEUE delay kind=%d delay=%lldms payload=%s",
                     (int)msg.kind, (long long)q_delay_ms, msg.payload);
        }

        switch (msg.kind) {
            case CMD_KIND_AUTO_PUMP:
                handle_auto_pump_payload(msg.payload);
                break;
            case CMD_KIND_DIRECT_PUMP:
                handle_dt_pump_payload(msg.payload);
                break;
            case CMD_KIND_DIRECT_LIGHT:
                handle_dt_light_payload(msg.payload, "DIRECT_DT");
                break;
            case CMD_KIND_PLANTING_START:
                handle_planting_start_payload(msg.payload);
                break;
            default:
                ESP_LOGW(TAG, "CMD_QUEUE unknown kind=%d", (int)msg.kind);
                break;
        }

        taskYIELD();
    }
}

/* ================================================================
   MQTT EVENT HANDLER
   ================================================================ */

static void mqtt_event_handler(void *arg, esp_event_base_t base, int32_t id, void *data) {
    esp_mqtt_event_handle_t ev = (esp_mqtt_event_handle_t)data;
    switch ((esp_mqtt_event_id_t)id) {
        case MQTT_EVENT_CONNECTED:
            s_mqtt_connected = true;
            esp_mqtt_client_subscribe(s_mqtt, TOPIC_CMD_PUMP_AUTO, MQTT_QOS_COMMAND);
            esp_mqtt_client_subscribe(s_mqtt, TOPIC_CMD_PUMP_DIRECT, MQTT_QOS_COMMAND);
            esp_mqtt_client_subscribe(s_mqtt, TOPIC_CMD_LIGHT_DIRECT, MQTT_QOS_COMMAND);
            esp_mqtt_client_subscribe(s_mqtt, TOPIC_CMD_PLANTING_START, MQTT_QOS_COMMAND);
            ESP_LOGI(TAG,
                     "MQTT connected %s:%d — sub: auto/pump, direct/pump, direct/light, config/planting_start | buffer=%d/%d",
                     MQTT_BROKER_URI, MQTT_PORT, ring_count(), RING_BUF_SIZE);
            publish_actuator_state("MQTT_CONNECTED");
            publish_planting_status("planting_start_current", "", "DONE", "MQTT_CONNECTED");
            break;
        case MQTT_EVENT_DISCONNECTED:
            s_mqtt_connected = false;
            ESP_LOGW(TAG, "MQTT mất kết nối — telemetry realtime sẽ drop, command/ACK giữ QoS1 | broker=%s:%d",
                     MQTT_BROKER_URI, MQTT_PORT);
            break;
        case MQTT_EVENT_ERROR:
            s_mqtt_connected = false;
            ESP_LOGE(TAG, "MQTT_EVENT_ERROR — broker/Raspberry Pi Gateway chưa ổn? broker=%s:%d",
                     MQTT_BROKER_URI, MQTT_PORT);
            break;
        case MQTT_EVENT_DATA:
            if (mqtt_topic_match(ev, TOPIC_CMD_PUMP_AUTO)) {
                enqueue_mqtt_command(CMD_KIND_AUTO_PUMP, ev);
            } else if (mqtt_topic_match(ev, TOPIC_CMD_PUMP_DIRECT)) {
                enqueue_mqtt_command(CMD_KIND_DIRECT_PUMP, ev);
            } else if (mqtt_topic_match(ev, TOPIC_CMD_LIGHT_DIRECT)) {
                enqueue_mqtt_command(CMD_KIND_DIRECT_LIGHT, ev);
            } else if (mqtt_topic_match(ev, TOPIC_CMD_PLANTING_START)) {
                enqueue_mqtt_command(CMD_KIND_PLANTING_START, ev);
            }
            break;
        default: break;
    }
}

static void mqtt_init(void) {
    esp_mqtt_client_config_t cfg = {
        .broker.address.uri  = MQTT_BROKER_URI,
        .broker.address.port = MQTT_PORT,
        .session.keepalive   = MQTT_KEEPALIVE_S,
        .credentials.client_id = MQTT_CLIENT_ID,
    };
    s_mqtt = esp_mqtt_client_init(&cfg);
    esp_mqtt_client_register_event(s_mqtt, ESP_EVENT_ANY_ID, mqtt_event_handler, NULL);
    esp_mqtt_client_start(s_mqtt);
}

/* ================================================================
   HARDWARE INIT
   ================================================================ */

static void hw_init(void) {
    ESP_ERROR_CHECK(i2cdev_init());

    memset(&s_rtc_dev, 0, sizeof(s_rtc_dev));
    if (ds3231_init_desc(&s_rtc_dev, I2C_MASTER_PORT,
                         I2C_MASTER_SDA, I2C_MASTER_SCL) != ESP_OK) {
        ESP_LOGE(TAG, "Lỗi: DS3231 init thất bại");
    } else {
        rtc_sync_compile_time();
    }

    gpio_config_t relay_cfg = {
        .pin_bit_mask = (1ULL << RELAY_PUMP_GPIO) | (1ULL << RELAY_LIGHT_GPIO),
        .mode         = GPIO_MODE_OUTPUT,
        .pull_down_en = GPIO_PULLDOWN_ENABLE,
        .pull_up_en   = GPIO_PULLUP_DISABLE,
        .intr_type    = GPIO_INTR_DISABLE,
    };
    gpio_config(&relay_cfg);
    gpio_set_level(RELAY_PUMP_GPIO,  0);
    gpio_set_level(RELAY_LIGHT_GPIO, 0);

    if (xSemaphoreTake(s_sensor_mutex, pdMS_TO_TICKS(100)) == pdTRUE) {
        g_sensor.phase = DEFAULT_PHASE;
        g_sensor.days_after_planting = 0.0f;
        strlcpy(g_sensor.phase_source, "BOOT_DEFAULT", sizeof(g_sensor.phase_source));
        strlcpy(g_sensor.pump_mode, "AI_AUTO", sizeof(g_sensor.pump_mode));
        strlcpy(g_sensor.pump_reason, "BOOT_OFF", sizeof(g_sensor.pump_reason));
        strlcpy(g_sensor.light_mode, "AUTO_RTC", sizeof(g_sensor.light_mode));
        strlcpy(g_sensor.light_reason, "PHASE1_LOW_LIGHT", sizeof(g_sensor.light_reason));
        xSemaphoreGive(s_sensor_mutex);
    }

    ESP_LOGI(TAG, "HW init xong | relay pump=GPIO%d OFF | relay light=GPIO%d OFF | default phase=%d(%s)",
             RELAY_PUMP_GPIO, RELAY_LIGHT_GPIO, DEFAULT_PHASE, phase_to_text(DEFAULT_PHASE));
}

/* ================================================================
   TASKS CỐT LÕI
   ================================================================ */

/**
 * @brief Task: Đọc tuần hoàn dữ liệu từ toàn bộ mảng cảm biến.
 */
static void sensor_task(void *pv) {
    ESP_LOGI(TAG, "sensor_task running on core %d prio=%d | SENSOR_READ_MS=%d DHT11_READ_MS=%d",
             xPortGetCoreID(), (int)uxTaskPriorityGet(NULL), SENSOR_READ_MS, DHT11_READ_MS);
    dht11_t dht = { .dht11_pin = DHT11_GPIO };
    float dht_cached_t = 0.0f;
    float dht_cached_h = 0.0f;
    bool dht_cache_valid = false;
    int dht_fail_streak = 0;
    int64_t last_dht_read_us = -((int64_t)DHT11_READ_MS * 1000LL);
    i2c_dev_t bh_dev = {0};
    bool bh_ready = false, ads_ready = false;

    if (i2c_take(1500)) {
        if (bh1750_init_desc(&bh_dev, BH1750_I2C_ADDR, I2C_MASTER_PORT, I2C_MASTER_SDA, I2C_MASTER_SCL) == ESP_OK
            && bh1750_power_on(&bh_dev) == ESP_OK
            && bh1750_setup(&bh_dev, BH1750_MODE_CONTINUOUS, BH1750_RES_HIGH2) == ESP_OK) {
            bh_ready = true;
        } else {
            ESP_LOGW(TAG, "BH1750 init/setup chưa sẵn sàng");
        }
        i2c_give();
    } else {
        ESP_LOGW(TAG, "BH1750 init skip: I2C busy");
    }

    if (i2c_take(1500)) {
        if (ads111x_init_desc(&s_ads_dev, ADS1115_I2C_ADDR, I2C_MASTER_PORT, I2C_MASTER_SDA, I2C_MASTER_SCL) == ESP_OK
            && ads111x_set_mode(&s_ads_dev, ADS111X_MODE_SINGLE_SHOT) == ESP_OK
            && ads111x_set_data_rate(&s_ads_dev, ADS111X_DATA_RATE_128) == ESP_OK
            && ads111x_set_gain(&s_ads_dev, ADS111X_GAIN_4V096) == ESP_OK) {
            ads_ready = true;
        } else {
            ESP_LOGW(TAG, "ADS1115 init/setup chưa sẵn sàng");
        }
        i2c_give();
    } else {
        ESP_LOGW(TAG, "ADS1115 init skip: I2C busy");
    }

    vTaskDelay(pdMS_TO_TICKS(2000));

    while (1) {
        sensor_data_t snap = {0};
        snap.uptime_s = (long)(esp_timer_get_time() / 1000000LL);
        rtc_get_iso(snap.iso_time, sizeof(snap.iso_time));
        snap.rtc_ok = (snap.iso_time[0] == '2');

        int64_t now_us = esp_timer_get_time();
        if ((now_us - last_dht_read_us) >= ((int64_t)DHT11_READ_MS * 1000LL)) {
            last_dht_read_us = now_us;
            if (dht11_read(&dht, 3) == 0 &&
                dht.temperature > 0.0f && dht.temperature <= 60.0f &&
                dht.humidity > 0.0f && dht.humidity <= 100.0f) {
                float ft, fh;
                dht11_moving_avg(dht.temperature, dht.humidity, &ft, &fh);
                dht_cached_t = ft;
                dht_cached_h = fh;
                dht_cache_valid = true;
                dht_fail_streak = 0;
            } else {
                dht_fail_streak++;
                if (dht_fail_streak <= 3 || (dht_fail_streak % 10) == 0) {
                    ESP_LOGW(TAG, "DHT11 checksum/read fail streak=%d -> %s",
                             dht_fail_streak,
                             dht_cache_valid ? "use last valid cache" : "NO valid cache yet");
                }
            }
        }

        if (dht_cache_valid) {
            snap.temperature = dht_cached_t;
            snap.air_humidity = dht_cached_h;
            /* lỗi 1-2 lần vẫn xem là usable vì đang dùng cache gần nhất; >2 lần báo dht11_ok=false. */
            snap.dht11_ok = (dht_fail_streak <= 2);
        } else {
            /* v2.9.8.3: chưa từng đọc được DHT thì không copy g_sensor=0 cũ. */
            snap.temperature = -1.0f;
            snap.air_humidity = -1.0f;
            snap.dht11_ok = false;
        }

        if (bh_ready) {
            uint16_t raw = 0;
            if (i2c_take(600)) {
                if (bh1750_read(&bh_dev, &raw) == ESP_OK) {
                    snap.lux = (float)raw / 2.0f;
                    snap.bh1750_ok = true;
                }
                i2c_give();
            }
        }

        if (ads_ready) {
            bool all_ok = true;
            if (i2c_take(3000)) {
                for (int i = 0; i < SOIL_CH_COUNT; i++) {
                    float voltage = 0.0f;
                    if (ads_read_channel_median_voltage(SOIL_MUX[i], &voltage)) {
                        snap.soil_voltage[i] = voltage;
                        snap.soil_pct[i] = ads_voltage_to_pct(voltage);
                    } else {
                        all_ok = false;
                    }
                }
                i2c_give();
            } else {
                all_ok = false;
                ESP_LOGW(TAG, "ADS1115 skip: I2C busy");
            }
            snap.ads1115_ok = all_ok;
        }

        apply_sensor_filter_and_fusion(&snap);

        wifi_ap_record_t ap;
        if (esp_wifi_sta_get_ap_info(&ap) == ESP_OK) snap.wifi_rssi = ap.rssi;

        if (xSemaphoreTake(s_sensor_mutex, pdMS_TO_TICKS(100)) == pdTRUE) {
            snap.pump_state = g_sensor.pump_state;
            strlcpy(snap.pump_mode,
                    g_sensor.pump_mode[0] ? g_sensor.pump_mode : "AI_AUTO",
                    sizeof(snap.pump_mode));
            strlcpy(snap.pump_reason,
                    g_sensor.pump_reason[0] ? g_sensor.pump_reason : "UNKNOWN",
                    sizeof(snap.pump_reason));
            snap.light_state = g_sensor.light_state;
            snap.phase       = g_sensor.phase ? g_sensor.phase : DEFAULT_PHASE;
            snap.days_after_planting = g_sensor.days_after_planting;
            strlcpy(snap.phase_source,
                    g_sensor.phase_source[0] ? g_sensor.phase_source : "UNKNOWN",
                    sizeof(snap.phase_source));
            strlcpy(snap.light_mode,
                    g_sensor.light_mode[0] ? g_sensor.light_mode : "AUTO_RTC",
                    sizeof(snap.light_mode));
            strlcpy(snap.light_reason,
                    g_sensor.light_reason[0] ? g_sensor.light_reason : "UNKNOWN",
                    sizeof(snap.light_reason));
            g_sensor = snap;
            xSemaphoreGive(s_sensor_mutex);
        }

        static int sensor_log_tick = 0;
        sensor_log_tick++;
        if ((sensor_log_tick % SENSOR_LOG_EVERY_N) == 0) {
            log_sensor_snapshot(&snap, s_step, ring_count());
        }

