lucas-traumen/Plant-Monitoring-CPS/esp32/esp32_v1/main/main.c
        vTaskDelay(pdMS_TO_TICKS(SENSOR_READ_MS));
    }
}

/**
 * @brief Task: ESP32 là nguồn phase chính.
 *
 * Luồng hiện tại:
 * - ESP32 đọc DS3231 RTC và tính days_after_planting từ planting_start_epoch lưu trong NVS. 
 * - Nếu days_after_planting < DARK_PHASE_DAYS => Phase 1.
 * - Nếu days_after_planting >= DARK_PHASE_DAYS => Phase 2.
 * - ESP32 tự bật/tắt đèn theo phase và lịch RTC.
 * - Gateway chỉ nhận phase trong JSON để chạy AI/ghi log, không gửi cmd/phase liên tục.
 */
static void light_schedule_task(void *pv) {
    ESP_LOGI(TAG, "light_schedule_task running on core %d", xPortGetCoreID());
    bool last_light_on = false;
    int  last_phase = -1;
    char last_reason[24] = {0};
    int heartbeat_tick = 0;

    while (1) {
        int phase = s_current_phase;
        float days_after_planting = -1.0f;
        char phase_source[24] = {0};
        bool rtc_phase_ok = rtc_get_phase_from_planting_time(&phase,
                                                             &days_after_planting,
                                                             phase_source,
                                                             sizeof(phase_source));
        s_current_phase = phase;

        int hour_utc7 = -1;
        bool rtc_hour_ok = rtc_get_hour_utc7(&hour_utc7);
        bool rtc_ok = rtc_phase_ok && rtc_hour_ok;

        /* Nếu Digital Twin đang điều khiển đèn trực tiếp thì không cho AUTO_RTC ghi đè. */
        if (light_direct_active()) {
            if (xSemaphoreTake(s_sensor_mutex, pdMS_TO_TICKS(100)) == pdTRUE) {
                g_sensor.phase = phase;
                g_sensor.days_after_planting = days_after_planting;
                strlcpy(g_sensor.phase_source, phase_source, sizeof(g_sensor.phase_source));
                g_sensor.rtc_ok = rtc_ok;
                xSemaphoreGive(s_sensor_mutex);
            }
            if (++heartbeat_tick >= (LIGHT_LOG_HEARTBEAT_S * 1000 / LIGHT_CTRL_MS)) {
                ESP_LOGW(TAG, "LIGHT AUTO_RTC paused: DIRECT_DT active, phase=%d days=%.2f",
                         phase, days_after_planting);
                heartbeat_tick = 0;
            }
            vTaskDelay(pdMS_TO_TICKS(LIGHT_CTRL_MS));
            continue;
        }

        if (s_light_direct_until_us > 0 && !light_direct_active()) {
            s_light_direct_until_us = 0;
            ESP_LOGI(TAG, "LIGHT DIRECT expired -> return AUTO_RTC");
        }

        bool light_on = false;
        const char *reason = "RTC_ERROR";

        if (rtc_hour_ok) {
            light_on = light_should_be_on_by_schedule(phase, hour_utc7);
            reason = (phase == PHASE_1_DARK) ? "PHASE1_LOW_LIGHT" :
                     (light_on ? "PHASE2_DAYLIGHT_SIM" : "PHASE2_NIGHT_SIM");
        }

        gpio_set_level(RELAY_LIGHT_GPIO, light_on ? 1 : 0);

        if (xSemaphoreTake(s_sensor_mutex, pdMS_TO_TICKS(100)) == pdTRUE) {
            g_sensor.phase = phase;
            g_sensor.days_after_planting = days_after_planting;
            strlcpy(g_sensor.phase_source, phase_source, sizeof(g_sensor.phase_source));
            g_sensor.light_state = light_on;
            g_sensor.rtc_ok = rtc_ok;
            strlcpy(g_sensor.light_mode, "AUTO_RTC", sizeof(g_sensor.light_mode));
            strlcpy(g_sensor.light_reason, reason, sizeof(g_sensor.light_reason));
            xSemaphoreGive(s_sensor_mutex);
        }

        heartbeat_tick++;
        bool changed = (phase != last_phase) ||
                       (light_on != last_light_on) ||
                       (strncmp(reason, last_reason, sizeof(last_reason)) != 0);

        if (changed || heartbeat_tick >= (LIGHT_LOG_HEARTBEAT_S * 1000 / LIGHT_CTRL_MS)) {
            ESP_LOGI(TAG, "LIGHT phase=%d(%s) source=%s days=%.2f rtc=%s hour=%d schedule=%02d-%02d => light=%s reason=%s",
                     phase, phase_to_text(phase), phase_source, days_after_planting,
                     rtc_ok ? "OK" : "ERR", hour_utc7,
                     LIGHT_ON_HOUR_UTC7, LIGHT_OFF_HOUR_UTC7,
                     light_on ? "ON" : "OFF", reason);
            last_phase = phase;
            last_light_on = light_on;
            strlcpy(last_reason, reason, sizeof(last_reason));
            heartbeat_tick = 0;
        }

        vTaskDelay(pdMS_TO_TICKS(LIGHT_CTRL_MS));
    }
}


/**
 * @brief Task: Bảo vệ actuator direct mode và publish trạng thái relay thật.
 *
 * - Nếu Digital Twin bật bơm với duration_s, ESP32 tự tắt khi hết thời gian.
 * - Publish định kỳ actuator/state để Gateway/Influx xác nhận trạng thái vật lý.
 */
static void actuator_state_task(void *pv) {
    ESP_LOGI(TAG, "actuator_state_task running on core %d", xPortGetCoreID());
    int64_t last_pub_us = 0;

    while (1) {
        int64_t now = esp_timer_get_time();

        if (s_pump_direct_until_us > 0 && now >= s_pump_direct_until_us) {
            bool was_on = false;
            if (xSemaphoreTake(s_sensor_mutex, pdMS_TO_TICKS(100)) == pdTRUE) {
                was_on = g_sensor.pump_state;
                xSemaphoreGive(s_sensor_mutex);
            }

            if (was_on) {
                set_pump_state(false, "AI_AUTO", "DIRECT_TIMEOUT_OFF");
                ESP_LOGW(TAG, "Pump DIRECT timeout -> OFF, return AI_AUTO");
                publish_actuator_state("PUMP_DIRECT_TIMEOUT");
            }
            s_pump_direct_until_us = 0;
        }

        if (s_light_direct_until_us > 0 && now >= s_light_direct_until_us) {
            s_light_direct_until_us = 0;
            ESP_LOGI(TAG, "Light DIRECT timeout -> AUTO_RTC will resume by schedule task");
            publish_actuator_state("LIGHT_DIRECT_TIMEOUT");
        }

        if (s_mqtt_connected && (now - last_pub_us) >= ((int64_t)ACTUATOR_STATE_PUBLISH_MS * 1000LL)) {
            publish_actuator_state("PERIODIC_STATE");
            last_pub_us = now;
        }

        vTaskDelay(pdMS_TO_TICKS(500));
    }
}

/**
 * @brief Task: Xuất dữ liệu lên MQTT và giải phóng bộ đệm (Drain Buffer).
 */
static void publish_task(void *pv) {
    ESP_LOGI(TAG, "publish_task running on core %d | telemetry QoS0=%d | no sensors/latest",
             xPortGetCoreID(), MQTT_QOS_TELEMETRY);
    static char json_buf[JSON_MAX_LEN];

    while (1) {
        vTaskDelay(pdMS_TO_TICKS(MQTT_PUBLISH_MS));
        sensor_data_t snap;
        if (xSemaphoreTake(s_sensor_mutex, pdMS_TO_TICKS(200)) == pdTRUE) {
            snap = g_sensor;
            xSemaphoreGive(s_sensor_mutex);
        } else continue;

