lucas-traumen/Plant-Monitoring-CPS/esp32/esp32_v1/main/main.c
        s_step++;
        int len = build_json(json_buf, sizeof(json_buf), &snap, s_step);
        if (len <= 0) continue;

        if (s_mqtt_connected) {
            /* v2.9.7: telemetry realtime 1s dùng QoS0 để không chặn socket MQTT.
             * Nếu mất 1 gói sensor thì Web/Unity nhận gói kế tiếp; command/ACK vẫn QoS1.
             */
            int msg_id = esp_mqtt_client_publish(s_mqtt, TOPIC_SENSOR, json_buf, len, MQTT_QOS_TELEMETRY, 0);
            if (msg_id < 0) {
                ESP_LOGW(TAG, "TELEMETRY drop step=%d — publish QoS0 fail, không lưu ring để tránh nghẽn", s_step);
            } else if ((s_step % SENSOR_LOG_EVERY_N) == 0) {
                ESP_LOGI(TAG, "PUBLISH_QOS0 step=%d msg_id=%d len=%d phase=%d soil=%.1f%% light=%s",
                         s_step, msg_id, len, snap.phase, soil_avg_from_snapshot(&snap),
                         snap.light_state ? "ON" : "OFF");
            }
        } else {
#if TELEMETRY_RING_ENABLE
            ring_push(json_buf);
#else
            if ((s_step % OFFLINE_LOG_EVERY_N) == 0) {
                ESP_LOGW(TAG, "OFFLINE step=%d — drop telemetry realtime, không buffer để giữ MQTT nhẹ", s_step);
            }
#endif
        }
    }
}

/* ================================================================
   MAIN ENTRY
   ================================================================ */

void app_main(void) {
    ESP_LOGI(TAG, "=== %s | %s v%s ===", PLANT_NAME, NODE_ID, FW_VERSION);
    ESP_LOGI(TAG, "MQTT broker=%s:%d | client_id=%s", MQTT_BROKER_URI, MQTT_PORT, MQTT_CLIENT_ID);
    ESP_LOGI(TAG, "Topics v2 | sensor=%s | esp32_status=%s | actuator_state=%s",
             TOPIC_SENSOR, TOPIC_STATUS_ESP32, TOPIC_ACTUATOR_STATE);
    ESP_LOGI(TAG, "Topics v2 | auto_pump=%s | direct_pump=%s | direct_light=%s | planting=%s",
             TOPIC_CMD_PUMP_AUTO, TOPIC_CMD_PUMP_DIRECT, TOPIC_CMD_LIGHT_DIRECT,
             TOPIC_CMD_PLANTING_START);

    esp_err_t nvs_ret = nvs_flash_init();
    if (nvs_ret == ESP_ERR_NVS_NO_FREE_PAGES || nvs_ret == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        nvs_flash_erase();
        nvs_flash_init();
    }

    s_sensor_mutex = xSemaphoreCreateMutex();
    s_i2c_mutex = xSemaphoreCreateMutex();
    setenv("TZ", TZ_INFO_UTC7, 1);
    tzset();
    ring_init();
    s_cmd_queue = xQueueCreate(CMD_QUEUE_LEN, sizeof(cmd_msg_t));
    if (!s_cmd_queue) {
        ESP_LOGE(TAG, "Không tạo được command queue");
    }
    hw_init();
    wifi_init();

    /* BOOT FLOW chuẩn v2.9.3:
     * 1) Nếu WiFi có IP thì check NTP và cập nhật DS3231 nếu lệch.
     * 2) Load planting_start_epoch từ NVS nếu có.
     * 3) Nếu NVS rỗng: valid=false, KHÔNG tự tạo mốc mới. Gateway sẽ sync từ DB/Unity.
     * 4) Task NTP sau đó chỉ sync DS3231 định kỳ, KHÔNG ghi lại mốc gieo.
     */
    EventBits_t boot_wifi_bits = xEventGroupGetBits(s_wifi_eg);
    if (boot_wifi_bits & WIFI_CONNECTED_BIT) {
        ntp_start_once();
        if (ntp_wait_time_valid(NTP_SYNC_TIMEOUT_MS)) {
            rtc_sync_from_ntp_if_needed();
        }
    } else {
        ESP_LOGW(TAG, "BOOT: chưa có WiFi, bỏ qua NTP ban đầu; dùng DS3231 hiện có để xét planting_start");
    }
    planting_start_init_from_nvs_or_rtc();

    mqtt_init();

    /* Core pinning v2.9.6:
     * CORE_NET: MQTT publish + NTP.
     * CORE_APP: actuator_cmd_task priority cao nhất; sensor/DHT không được chặn command.
     */
    xTaskCreatePinnedToCore(ntp_rtc_sync_task,   "ntp_rtc", 4096, NULL, PRIO_NTP_RTC, NULL, CORE_NET);
    xTaskCreatePinnedToCore(publish_task,        "publish",  4096, NULL, PRIO_PUBLISH, NULL, CORE_NET);

    xTaskCreatePinnedToCore(actuator_cmd_task,   "act_cmd",  4096, NULL, PRIO_ACTUATOR_CMD, NULL, CORE_APP);
    xTaskCreatePinnedToCore(actuator_state_task, "act_state",4096, NULL, PRIO_ACTUATOR_STATE, NULL, CORE_APP);
    xTaskCreatePinnedToCore(light_schedule_task, "light",    3072, NULL, PRIO_LIGHT_SCHEDULE, NULL, CORE_APP);
    xTaskCreatePinnedToCore(sensor_task,         "sensor",   4096, NULL, PRIO_SENSOR, NULL, CORE_APP);

    ESP_LOGI(TAG, "Tất cả tasks đã khởi động v2.9.7 (QoS split: telemetry QoS0, command/ACK QoS1, latest retain QoS1)");
}
